{
  "mixed_topics": [
    {
      "topicName_real": "Work",
      "topicName_rewrite": "Professional Engagement",
      "topicName_cn": "职业参与",
      "topicId": "Basic_25Q2_t1",
      "questions": [
        {
          "qTitle": "What's your job?",
          "qRewrite": "Could you elaborate on your current professional role and responsibilities?",
          "qTitle_cn": "您能详细描述一下您目前的职业角色和职责吗？",
          "qId": "Basic_25Q2_q1"
        },
        {
          "qTitle": "Do you sometimes feel that you have to work too hard?",
          "qRewrite": "To what extent do you experience periods of intense workload in your profession?",
          "qTitle_cn": "您在工作中是否经常感到压力很大？",
          "qId": "Basic_25Q2_q2"
        },
        {
          "qTitle": "What do you like to do just after you finish work every day?",
          "qRewrite": "How do you typically decompress and transition from your professional to personal life?",
          "qTitle_cn": "您每天下班后通常喜欢做什么来放松？",
          "qId": "Basic_25Q2_q3"
        },
        {
          "qTitle": "What do you need to do when you work?",
          "qRewrite": "What are the essential tasks and competencies required in your professional role?",
          "qTitle_cn": "您的工作岗位需要哪些必要的技能和任务？",
          "qId": "Basic_25Q2_q4"
        },
        {
          "qTitle": "What do you think is the most difficult part of your work?",
          "qRewrite": "Which aspects of your professional responsibilities do you find most challenging?",
          "qTitle_cn": "您认为工作中最具挑战性的方面是什么？",
          "qId": "Basic_25Q2_q5"
        },
        {
          "qTitle": "Who helped you a lot about your work?",
          "qRewrite": "Which individuals have been particularly influential in your professional development?",
          "qTitle_cn": "在您的职业发展中，谁给予了您重要的帮助？",
          "qId": "Basic_25Q2_q6"
        }
      ]
    },
    {
      "topicName_real": "Study",
      "topicName_rewrite": "Academic Endeavors",
      "topicName_cn": "学术追求",
      "topicId": "Basic_25Q2_t2",
      "questions": [
        {
          "qTitle": "What do you study?",
          "qRewrite": "Could you describe the field of study you're currently pursuing?",
          "qTitle_cn": "您能描述一下您目前的学习领域吗？",
          "qId": "Basic_25Q2_q7"
        },
        {
          "qTitle": "Do you sometimes feel that you have to study too hard?",
          "qRewrite": "How do you manage the intensity of your academic workload?",
          "qTitle_cn": "您如何应对繁重的学习压力？",
          "qId": "Basic_25Q2_q8"
        },
        {
          "qTitle": "What do you like to do just after you finish class every day?",
          "qRewrite": "What activities help you unwind after your academic commitments?",
          "qTitle_cn": "每天下课后，您喜欢通过什么活动来放松？",
          "qId": "Basic_25Q2_q9"
        },
        {
          "qTitle": "What do you need to do to study your major?",
          "qRewrite": "What are the key requirements and practices in your field of study?",
          "qTitle_cn": "在您的专业领域，有哪些关键的学习要求和实践？",
          "qId": "Basic_25Q2_q10"
        },
        {
          "qTitle": "What do you think is the most difficult part of your major?",
          "qRewrite": "Which aspects of your academic program present the greatest challenges?",
          "qTitle_cn": "您认为专业学习中最具挑战性的部分是什么？",
          "qId": "Basic_25Q2_q11"
        },
        {
          "qTitle": "Who helped you a lot about your studies?",
          "qRewrite": "Who has been particularly instrumental in supporting your academic journey?",
          "qTitle_cn": "在您的学习过程中，谁给予了您特别重要的支持？",
          "qId": "Basic_25Q2_q12"
        }
      ]
    },
    {
      "topicName_real": "Where you live",
      "topicName_rewrite": "Residential Environment",
      "topicName_cn": "居住环境",
      "topicId": "Basic_25Q2_t3",
      "questions": [
        {
          "qTitle": "Where are you living at the moment?",
          "qRewrite": "Could you describe the characteristics of your current living location?",
          "qTitle_cn": "您能描述一下您目前居住地的特点吗？",
          "qId": "Basic_25Q2_q13"
        },
        {
          "qTitle": "What do you like about the area you're living in?",
          "qRewrite": "Which aspects of your residential neighborhood do you find particularly appealing?",
          "qTitle_cn": "您最喜欢所居住区域的哪些方面？",
          "qId": "Basic_25Q2_q14"
        },
        {
          "qTitle": "Do you know many other people who live nearby?",
          "qRewrite": "To what extent have you developed connections within your local community?",
          "qTitle_cn": "您在当地社区建立了多少人际联系？",
          "qId": "Basic_25Q2_q15"
        },
        {
          "qTitle": "How long have you lived in your area now?",
          "qRewrite": "What duration of time have you spent in your current residential location?",
          "qTitle_cn": "您在目前的居住地生活了多长时间？",
          "qId": "Basic_25Q2_q16"
        },
        {
          "qTitle": "Do you live alone or with others?",
          "qRewrite": "What is the nature of your living arrangements in terms of cohabitation?",
          "qTitle_cn": "您是独居还是与他人同住？",
          "qId": "Basic_25Q2_q17"
        },
        {
          "qTitle": "What do you want to change about the area you live?",
          "qRewrite": "Which aspects of your neighborhood would you consider enhancing if possible?",
          "qTitle_cn": "如果可能的话，您希望改善居住区域的哪些方面？",
          "qId": "Basic_25Q2_q18"
        }
      ]
    },
    {
      "topicName_real": "Birthdays",
      "topicName_rewrite": "Birthday Celebrations",
      "topicName_cn": "生日庆祝",
      "topicId": "Basic_25Q2_t4",
      "questions": [
        {
          "qTitle": "What do you normally do on your birthday?",
          "qRewrite": "How do you typically commemorate your annual birthday celebration?",
          "qTitle_cn": "您通常如何庆祝自己的生日？",
          "qId": "Basic_25Q2_q19"
        },
        {
          "qTitle": "What did you like to do on your birthday when you were a child?",
          "qRewrite": "What birthday traditions particularly resonated with you during your childhood?",
          "qTitle_cn": "在童年时期，您特别喜欢怎样庆祝生日？",
          "qId": "Basic_25Q2_q20"
        },
        {
          "qTitle": "How important are birthdays to you now?",
          "qRewrite": "What significance do birthday celebrations hold in your current life stage?",
          "qTitle_cn": "目前生日对您来说有多重要？",
          "qId": "Basic_25Q2_q21"
        },
        {
          "qTitle": "Which birthdays are most important in your country?",
          "qRewrite": "Which milestone birthdays carry particular cultural significance in your society?",
          "qTitle_cn": "在您的国家，哪些生日具有特殊的文化意义？",
          "qId": "Basic_25Q2_q22"
        }
      ]
    },
    {
      "topicName_real": "Technology",
      "topicName_rewrite": "Digital Integration",
      "topicName_cn": "数字科技融合",
      "topicId": "Basic_25Q2_t5",
      "questions": [
        {
          "qTitle": "What types of technology do you use most?",
          "qRewrite": "Which technological devices feature most prominently in your daily routine?",
          "qTitle_cn": "您日常最常使用哪些科技设备？",
          "qId": "Basic_25Q2_q23"
        },
        {
          "qTitle": "Do you like using technology?",
          "qRewrite": "What aspects of modern technology do you find most beneficial or appealing?",
          "qTitle_cn": "现代科技的哪些方面最吸引您或对您最有帮助？",
          "qId": "Basic_25Q2_q24"
        },
        {
          "qTitle": "Is there a piece of technology that you would like to buy?",
          "qRewrite": "Which technological innovation are you currently considering acquiring?",
          "qTitle_cn": "您目前有考虑购买哪些科技产品吗？",
          "qId": "Basic_25Q2_q25"
        },
        {
          "qTitle": "What made you choose the last piece of technology you bought?",
          "qRewrite": "What factors influenced your most recent technological purchase decision?",
          "qTitle_cn": "是什么因素影响了您最近一次购买科技产品的决定？",
          "qId": "Basic_25Q2_q26"
        }
      ]
    },
    {
      "topicName_real": "Writing",
      "topicName_rewrite": "Written Expression",
      "topicName_cn": "书面表达",
      "topicId": "Basic_25Q2_t6",
      "questions": [
        {
          "qTitle": "What kinds of things do you write during a typical day?",
          "qRewrite": "What forms of written communication do you engage with in your daily routine?",
          "qTitle_cn": "在日常生活中，您会进行哪些形式的书面交流？",
          "qId": "Basic_25Q2_q27"
        },
        {
          "qTitle": "Do you prefer typing or writing things by hand?",
          "qRewrite": "Which method of written composition do you find more conducive to your needs: digital or manual?",
          "qTitle_cn": "您更倾向于使用电子输入还是手写方式？",
          "qId": "Basic_25Q2_q28"
        },
        {
          "qTitle": "Did you like writing when you were a child?",
          "qRewrite": "What was your relationship with written expression during your childhood years?",
          "qTitle_cn": "在童年时期，您与写作之间的关系如何？",
          "qId": "Basic_25Q2_q29"
        },
        {
          "qTitle": "Do you think the kinds of things you write will change in the future?",
          "qRewrite": "How do you anticipate your writing practices evolving in the coming years?",
          "qTitle_cn": "您认为未来您的写作方式会有什么变化？",
          "qId": "Basic_25Q2_q30"
        }
      ]
    },
    {
      "topicName_real": "Geography",
      "topicName_rewrite": "Geographical Knowledge",
      "topicName_cn": "地理知识",
      "topicId": "Basic_25Q2_t7",
      "questions": [
        {
          "qTitle": "Did/do you study geography at school?",
          "qRewrite": "What exposure have you had to geographical studies in your academic experience?",
          "qTitle_cn": "您在学校学习地理的经历如何？",
          "qId": "Basic_25Q2_q31"
        },
        {
          "qTitle": "Do you enjoy learning about the geography of other countries?",
          "qRewrite": "What aspects of international geographical features intrigue you most?",
          "qTitle_cn": "其他国家的地理特征哪些方面最吸引您？",
          "qId": "Basic_25Q2_q32"
        },
        {
          "qTitle": "Is there a country you'd like to visit because of its geography?",
          "qRewrite": "Which nation's geographical characteristics particularly attract your interest for potential visits?",
          "qTitle_cn": "有哪个国家的地理特征特别吸引您想去参观？",
          "qId": "Basic_25Q2_q33"
        },
        {
          "qTitle": "How good are you at reading maps?",
          "qRewrite": "To what extent have you developed your cartographic interpretation skills?",
          "qTitle_cn": "您的地图阅读能力如何？",
          "qId": "Basic_25Q2_q34"
        }
      ]
    },
    {
      "topicName_real": "Weather",
      "topicName_rewrite": "Meteorological Preferences",
      "topicName_cn": "天气偏好",
      "topicId": "Basic_25Q2_t8",
      "questions": [
        {
          "qTitle": "How often do you check the weather forecast?",
          "qRewrite": "What is your frequency of consulting meteorological predictions?",
          "qTitle_cn": "您多久查看一次天气预报？",
          "qId": "Basic_25Q2_q35"
        },
        {
          "qTitle": "Do you generally prefer hot weather or cold weather?",
          "qRewrite": "Which climatic conditions align more closely with your personal comfort?",
          "qTitle_cn": "您个人更喜欢炎热还是寒冷的天气？",
          "qId": "Basic_25Q2_q36"
        },
        {
          "qTitle": "Has the weather changed much in recent years in your country?",
          "qRewrite": "What notable climate patterns have you observed in your region recently?",
          "qTitle_cn": "近年来您所在地区的气候有什么明显变化？",
          "qId": "Basic_25Q2_q37"
        },
        {
          "qTitle": "Would you like to live in a place that has a very different climate from your country?",
          "qRewrite": "How do you feel about potentially residing in an area with contrasting weather patterns?",
          "qTitle_cn": "您对居住在气候与本国完全不同的地方有什么想法？",
          "qId": "Basic_25Q2_q38"
        }
      ]
    },
    {
      "topicName_real": "Mornings times",
      "topicName_rewrite": "Morning Routines",
      "topicName_cn": "晨间习惯",
      "topicId": "Basic_25Q2_t9",
      "questions": [
        {
          "qTitle": "Do you like getting up early in the morning?",
          "qRewrite": "What are your sentiments towards early morning awakening?",
          "qTitle_cn": "您对早起有什么看法？",
          "qId": "Basic_25Q2_q39"
        },
        {
          "qTitle": "Do you eat breakfast at home every morning?",
          "qRewrite": "To what extent is home-prepared breakfast integrated into your morning routine?",
          "qTitle_cn": "在家吃早餐是您晨间例行的一部分吗？",
          "qId": "Basic_25Q2_q40"
        },
        {
          "qTitle": "Do you have the same morning routine every day of the week?",
          "qRewrite": "How consistent are your morning practices throughout the week?",
          "qTitle_cn": "您的晨间作息在一周内保持一致吗？",
          "qId": "Basic_25Q2_q41"
        },
        {
          "qTitle": "Are your mornings very different now from when you were younger?",
          "qRewrite": "In what ways have your morning habits evolved since your earlier years?",
          "qTitle_cn": "与年轻时相比，您的晨间习惯有什么变化？",
          "qId": "Basic_25Q2_q42"
        }
      ]
    },
    {
      "topicName_real": "Housework and cooking",
      "topicName_rewrite": "Domestic Management",
      "topicName_cn": "家务管理",
      "topicId": "Basic_25Q2_t10",
      "questions": [
        {
          "qTitle": "Did you do anything to help at home when you were younger?",
          "qRewrite": "What domestic responsibilities did you assume during your younger years?",
          "qTitle_cn": "在年轻时，您在家里承担过哪些家务责任？",
          "qId": "Basic_25Q2_q43"
        },
        {
          "qTitle": "Do you do a lot of cooking at home now?",
          "qRewrite": "To what extent are you involved in household meal preparation currently?",
          "qTitle_cn": "目前您在家中参与烹饪的程度如何？",
          "qId": "Basic_25Q2_q44"
        },
        {
          "qTitle": "Do you like everything to be very tidy at home?",
          "qRewrite": "How significant is maintaining orderliness in your living environment?",
          "qTitle_cn": "保持居家环境整洁对您来说有多重要？",
          "qId": "Basic_25Q2_q45"
        },
        {
          "qTitle": "Is there a job at home that you really don't enjoy doing?",
          "qRewrite": "Which household task do you find particularly challenging or unpleasant?",
          "qTitle_cn": "有什么家务工作是您特别不喜欢做的？",
          "qId": "Basic_25Q2_q46"
        }
      ]
    },
    {
      "topicName_real": "Public transport",
      "topicName_rewrite": "Public Transportation",
      "topicName_cn": "公共交通",
      "topicId": "Basic_25Q2_t11",
      "questions": [
        {
          "qTitle": "Do you often travel on public transport?",
          "qRewrite": "How frequently do you utilize public transportation systems?",
          "qTitle_cn": "您多常使用公共交通系统？",
          "qId": "Basic_25Q2_q47"
        },
        {
          "qTitle": "Did you use public transport when you were a child?",
          "qRewrite": "What role did public transportation play in your early years?",
          "qTitle_cn": "在您童年时期，公共交通在您生活中扮演什么角色？",
          "qId": "Basic_25Q2_q48"
        },
        {
          "qTitle": "Do many people use public transport in your country?",
          "qRewrite": "How prevalent is public transportation usage in your society?",
          "qTitle_cn": "在您的社会中，公共交通的使用普及程度如何？",
          "qId": "Basic_25Q2_q49"
        },
        {
          "qTitle": "Will you use public transport more in the future?",
          "qRewrite": "Do you anticipate increasing your reliance on public transportation systems?",
          "qTitle_cn": "您预计未来会更多地依赖公共交通系统吗？",
          "qId": "Basic_25Q2_q50"
        }
      ]
    },
    {
      "topicName_real": "Puzzles",
      "topicName_rewrite": "Problem-Solving Activities",
      "topicName_cn": "解谜活动",
      "topicId": "Basic_25Q2_t12",
      "questions": [
        {
          "qTitle": "Did you enjoy doing puzzles when you were a child?",
          "qRewrite": "What was your relationship with puzzle-solving activities during your childhood?",
          "qTitle_cn": "在童年时期，您与解谜活动的关系如何？",
          "qId": "Basic_25Q2_q51"
        },
        {
          "qTitle": "Which do you find easier to do: word puzzles or number puzzles?",
          "qRewrite": "Do you find greater facility with linguistic or numerical puzzle challenges?",
          "qTitle_cn": "您觉得文字谜题还是数字谜题更容易？",
          "qId": "Basic_25Q2_q52"
        },
        {
          "qTitle": "Would you ever do a puzzle when you're travelling?",
          "qRewrite": "To what extent do you incorporate puzzle-solving into your travel activities?",
          "qTitle_cn": "您会在旅行时进行解谜活动吗？",
          "qId": "Basic_25Q2_q53"
        },
        {
          "qTitle": "Do you think doing puzzles is a good way for older people to spend their free time?",
          "qRewrite": "How beneficial do you consider puzzle activities for cognitive maintenance in elderly populations?",
          "qTitle_cn": "您认为解谜活动对老年人的认知保健有多大帮助？",
          "qId": "Basic_25Q2_q54"
        }
      ]
    },
    {
      "topicName_real": "Names",
      "topicName_rewrite": "Nominal Identity",
      "topicName_cn": "名字身份",
      "topicId": "Basic_25Q2_t13",
      "questions": [
        {
          "qTitle": "Does anyone in your family have the same name as you?",
          "qRewrite": "Are there any instances of name sharing within your family circle?",
          "qTitle_cn": "在您的家族中是否有人与您同名？",
          "qId": "Basic_25Q2_q55"
        },
        {
          "qTitle": "Does your name have any meaning?",
          "qRewrite": "What significance or etymology is associated with your given name?",
          "qTitle_cn": "您的名字有什么特殊含义或来源？",
          "qId": "Basic_25Q2_q56"
        },
        {
          "qTitle": "What name would you choose to give a child?",
          "qRewrite": "Which naming considerations would influence your choice for offspring?",
          "qTitle_cn": "您会考虑给孩子取什么样的名字？",
          "qId": "Basic_25Q2_q57"
        },
        {
          "qTitle": "Are some names more popular than others in your country?",
          "qRewrite": "What naming trends or patterns are prevalent in your cultural context?",
          "qTitle_cn": "在您的文化背景下，有哪些流行的取名趋势或模式？",
          "qId": "Basic_25Q2_q58"
        }
      ]
    },
    {
      "topicName_real": "Singing",
      "topicName_rewrite": "Vocal Expression",
      "topicName_cn": "歌唱表达",
      "topicId": "Basic_25Q2_t14",
      "questions": [
        {
          "qTitle": "Did you learn to sing when you were at school?",
          "qRewrite": "What exposure did you have to vocal training during your educational years?",
          "qTitle_cn": "您在学校时期接受过什么样的声乐训练？",
          "qId": "Basic_25Q2_q59"
        },
        {
          "qTitle": "Would you ever sing with other people now?",
          "qRewrite": "How do you feel about participating in group vocal activities currently?",
          "qTitle_cn": "您现在对参与集体歌唱活动有什么看法？",
          "qId": "Basic_25Q2_q60"
        },
        {
          "qTitle": "Do you like listening to other people sing?",
          "qRewrite": "What is your response to live vocal performances by others?",
          "qTitle_cn": "您对观看他人现场演唱有什么反应？",
          "qId": "Basic_25Q2_q61"
        },
        {
          "qTitle": "Do you think singing can make people feel happy?",
          "qRewrite": "How do you perceive the emotional impact of vocal expression on well-being?",
          "qTitle_cn": "您如何看待歌唱对人们情绪健康的影响？",
          "qId": "Basic_25Q2_q62"
        }
      ]
    },
    {
      "topicName_real": "Social media",
      "topicName_rewrite": "Digital Social Engagement",
      "topicName_cn": "数字社交参与",
      "topicId": "Basic_25Q2_t15",
      "questions": [
        {
          "qTitle": "How often do you use social media?",
          "qRewrite": "What is your frequency of engagement with social networking platforms?",
          "qTitle_cn": "您使用社交网络平台的频率如何？",
          "qId": "Basic_25Q2_q63"
        },
        {
          "qTitle": "Did you use social media more in the past?",
          "qRewrite": "How has your social media consumption pattern evolved over time?",
          "qTitle_cn": "您的社交媒体使用模式是如何随时间演变的？",
          "qId": "Basic_25Q2_q64"
        },
        {
          "qTitle": "Do you think your friends use social media too much?",
          "qRewrite": "What are your observations regarding your peers' social media engagement levels?",
          "qTitle_cn": "您如何看待朋友们的社交媒体使用程度？",
          "qId": "Basic_25Q2_q65"
        },
        {
          "qTitle": "Would you like to work in social media in the future?",
          "qRewrite": "Do you envision a professional career involving social media platforms?",
          "qTitle_cn": "您是否考虑未来从事社交媒体相关的职业？",
          "qId": "Basic_25Q2_q66"
        }
      ]
    },
    {
      "topicName_real": "Snacks",
      "topicName_rewrite": "Dietary Habits",
      "topicName_cn": "饮食习惯",
      "topicId": "Basic_25Q2_t16",
      "questions": [
        {
          "qTitle": "When you were a child, did you have a favourite snack?",
          "qRewrite": "What snack foods particularly appealed to you during your childhood?",
          "qTitle_cn": "在童年时期，您特别喜欢什么零食？",
          "qId": "Basic_25Q2_q67"
        },
        {
          "qTitle": "When do you eat snacks now?",
          "qRewrite": "At what intervals do you typically incorporate snacks into your daily routine?",
          "qTitle_cn": "您现在通常在什么时候吃零食？",
          "qId": "Basic_25Q2_q68"
        },
        {
          "qTitle": "Would you choose a snack that is healthy, or a snack that tastes good?",
          "qRewrite": "How do you balance nutritional value against palatability in snack selection?",
          "qTitle_cn": "在选择零食时，您更注重健康还是口味？",
          "qId": "Basic_25Q2_q69"
        },
        {
          "qTitle": "Do people in your country often eat snacks between meals?",
          "qRewrite": "To what extent is intermeal snacking prevalent in your cultural context?",
          "qTitle_cn": "在您的文化背景下，人们在正餐之间吃零食的情况有多普遍？",
          "qId": "Basic_25Q2_q70"
        }
      ]
    },
    {
      "topicName_real": "Flowers",
      "topicName_rewrite": "Floral Appreciation",
      "topicName_cn": "花卉欣赏",
      "topicId": "Basic_25Q2_t17",
      "questions": [
        {
          "qTitle": "Do you love flowers?",
          "qRewrite": "What is your emotional response to floral displays?",
          "qTitle_cn": "您对花卉展示有什么情感反应？",
          "qId": "Basic_25Q2_q71"
        },
        {
          "qTitle": "Do you know anyone who loves flowers?",
          "qRewrite": "Are you acquainted with individuals who have a particular appreciation for floriculture?",
          "qTitle_cn": "您认识特别喜爱花卉的人吗？",
          "qId": "Basic_25Q2_q72"
        },
        {
          "qTitle": "Are there a lot of flowers where you live?",
          "qRewrite": "How would you characterize the floral diversity in your residential environment?",
          "qTitle_cn": "您居住的环境中花卉种类丰富吗？",
          "qId": "Basic_25Q2_q73"
        },
        {
          "qTitle": "Do you take photos of flowers in your daily life?",
          "qRewrite": "To what extent do you document floral specimens through photography?",
          "qTitle_cn": "您在日常生活中会拍摄花卉照片吗？",
          "qId": "Basic_25Q2_q74"
        },
        {
          "qTitle": "Do people in your country often send flowers to others?",
          "qRewrite": "How prevalent is the practice of floral gifting in your cultural context?",
          "qTitle_cn": "在您的文化背景下，赠送鲜花的习俗有多普遍？",
          "qId": "Basic_25Q2_q75"
        }
      ]
    },
    {
      "topicName_real": "Memory",
      "topicName_rewrite": "Cognitive Retention",
      "topicName_cn": "认知记忆",
      "topicId": "Basic_25Q2_t18",
      "questions": [
        {
          "qTitle": "Are you good at memorising things?",
          "qRewrite": "How would you evaluate your capacity for information retention?",
          "qTitle_cn": "您如何评价自己的记忆力？",
          "qId": "Basic_25Q2_q76"
        },
        {
          "qTitle": "Have you ever forgotten something important?",
          "qRewrite": "Can you recall instances of significant memory lapses?",
          "qTitle_cn": "您是否经历过遗忘重要事情的情况？",
          "qId": "Basic_25Q2_q77"
        },
        {
          "qTitle": "What do you need to remember in your daily life?",
          "qRewrite": "What information requires active retention in your daily routine?",
          "qTitle_cn": "在日常生活中，您需要记住哪些信息？",
          "qId": "Basic_25Q2_q78"
        },
        {
          "qTitle": "How do you remember important things?",
          "qRewrite": "What strategies do you employ for retaining crucial information?",
          "qTitle_cn": "您用什么方法记住重要信息？",
          "qId": "Basic_25Q2_q79"
        }
      ]
    },
    {
      "topicName_real": "Machine",
      "topicName_rewrite": "Technological Appliances",
      "topicName_cn": "科技设备",
      "topicId": "Basic_25Q2_t19",
      "questions": [
        {
          "qTitle": "What is your favourite machine in your home?",
          "qRewrite": "Which household appliance do you find most indispensable?",
          "qTitle_cn": "在家中，您最离不开哪种电器？",
          "qId": "Basic_25Q2_q80"
        },
        {
          "qTitle": "Do you think washing machines and sweeping machines are important?",
          "qRewrite": "How essential do you consider automated cleaning appliances in modern living?",
          "qTitle_cn": "您认为洗衣机和扫地机在现代生活中有多重要？",
          "qId": "Basic_25Q2_q81"
        },
        {
          "qTitle": "Do you read the instructions before using a machine?",
          "qRewrite": "What is your approach to familiarizing yourself with new appliance operations?",
          "qTitle_cn": "在使用新设备前，您会阅读使用说明吗？",
          "qId": "Basic_25Q2_q82"
        },
        {
          "qTitle": "Do you think it is important to read the instructions?",
          "qRewrite": "How significant do you consider manual consultation for optimal device utilization?",
          "qTitle_cn": "您认为阅读使用说明对于设备使用有多重要？",
          "qId": "Basic_25Q2_q83"
        }
      ]
    },
    {
      "topicName_real": "Patience",
      "topicName_rewrite": "Emotional Resilience",
      "topicName_cn": "情绪韧性",
      "topicId": "Basic_25Q2_t20",
      "questions": [
        {
          "qTitle": "Are you a patient person?",
          "qRewrite": "How would you characterize your capacity for maintaining composure in challenging situations?",
          "qTitle_cn": "您如何评价自己在面对挑战时保持冷静的能力？",
          "qId": "Basic_25Q2_q84"
        },
        {
          "qTitle": "What is it that makes you feel impatient?",
          "qRewrite": "Which circumstances tend to challenge your emotional equilibrium?",
          "qTitle_cn": "什么情况会让您感到不耐烦？",
          "qId": "Basic_25Q2_q85"
        },
        {
          "qTitle": "How do you feel when you have to do something for a long time?",
          "qRewrite": "What is your emotional response to extended duration tasks?",
          "qTitle_cn": "当需要长时间做某事时，您的情绪反应如何？",
          "qId": "Basic_25Q2_q86"
        },
        {
          "qTitle": "Does your job require you to be patient?",
          "qRewrite": "To what extent does your professional role demand emotional restraint?",
          "qTitle_cn": "您的工作在多大程度上需要保持耐心？",
          "qId": "Basic_25Q2_q87"
        },
        {
          "qTitle": "Are you more patient now than when you were a child?",
          "qRewrite": "How has your capacity for patience evolved since your younger years?",
          "qTitle_cn": "与童年相比，您的耐心有什么变化？",
          "qId": "Basic_25Q2_q88"
        }
      ]
    },
    {
      "topicName_real": "Spare time",
      "topicName_rewrite": "Leisure Activities",
      "topicName_cn": "休闲活动",
      "topicId": "Basic_25Q2_t21",
      "questions": [
        {
          "qTitle": "Do you have much spare time?",
          "qRewrite": "How would you characterize the availability of leisure time in your schedule?",
          "qTitle_cn": "您的日程安排中有多少空闲时间？",
          "qId": "Basic_25Q2_q89"
        },
        {
          "qTitle": "What do you like to do in your spare time?",
          "qRewrite": "Which activities do you prioritize during your leisure hours?",
          "qTitle_cn": "在空闲时间，您最喜欢做什么活动？",
          "qId": "Basic_25Q2_q90"
        },
        {
          "qTitle": "Do you think it is important to have spare time?",
          "qRewrite": "How do you view the significance of maintaining leisure time in one's life?",
          "qTitle_cn": "您认为保持空闲时间的重要性如何？",
          "qId": "Basic_25Q2_q91"
        },
        {
          "qTitle": "Do you have more spare time than before?",
          "qRewrite": "How has the allocation of your leisure time evolved over recent periods?",
          "qTitle_cn": "与以前相比，您现在的空闲时间有什么变化？",
          "qId": "Basic_25Q2_q92"
        }
      ]
    },
    {
      "topicName_real": "Saying thank you",
      "topicName_rewrite": "Expressions of Gratitude",
      "topicName_cn": "感恩表达",
      "topicId": "Basic_25Q2_t22",
      "questions": [
        {
          "qTitle": "Do you often say thank you?",
          "qRewrite": "How frequently do you express gratitude in your daily interactions?",
          "qTitle_cn": "您在日常交往中经常表达感谢吗？",
          "qId": "Basic_25Q2_q93"
        },
        {
          "qTitle": "When do you say thank you?",
          "qRewrite": "In what situations do you typically express appreciation?",
          "qTitle_cn": "您通常在什么情况下表达感谢？",
          "qId": "Basic_25Q2_q94"
        },
        {
          "qTitle": "Do you think people should say thank you more?",
          "qRewrite": "What are your views on the frequency of gratitude expression in society?",
          "qTitle_cn": "您认为人们是否应该更多地表达感谢？",
          "qId": "Basic_25Q2_q95"
        },
        {
          "qTitle": "Do you write thank you cards?",
          "qRewrite": "How do you incorporate written expressions of gratitude into your communication?",
          "qTitle_cn": "您会写感谢卡表达谢意吗？",
          "qId": "Basic_25Q2_q96"
        }
      ]
    },
    {
      "topicName_real": "Being busy",
      "topicName_rewrite": "Time Management",
      "topicName_cn": "时间管理",
      "topicId": "Basic_25Q2_t23",
      "questions": [
        {
          "qTitle": "Are you usually busy?",
          "qRewrite": "How would you characterize your typical daily schedule in terms of activity level?",
          "qTitle_cn": "您的日常时间安排通常有多忙碌？",
          "qId": "Basic_25Q2_q97"
        },
        {
          "qTitle": "What do you do when you are busy?",
          "qRewrite": "What activities typically occupy your time during busy periods?",
          "qTitle_cn": "在忙碌时期，您主要做些什么？",
          "qId": "Basic_25Q2_q98"
        },
        {
          "qTitle": "Do you like being busy?",
          "qRewrite": "How do you feel about maintaining a high level of activity in your daily life?",
          "qTitle_cn": "您喜欢保持忙碌的状态吗？",
          "qId": "Basic_25Q2_q99"
        },
        {
          "qTitle": "What do you do to relax when you are very busy?",
          "qRewrite": "What strategies do you employ for stress relief during intense periods of activity?",
          "qTitle_cn": "在非常忙碌时，您如何放松自己？",
          "qId": "Basic_25Q2_q100"
        }
      ]
    },
    {
      "topicName_real": "List",
      "topicName_rewrite": "Organization Methods",
      "topicName_cn": "组织方法",
      "topicId": "Basic_25Q2_t24",
      "questions": [
        {
          "qTitle": "Do you make lists?",
          "qRewrite": "How do you incorporate list-making into your organizational strategy?",
          "qTitle_cn": "您会制作清单来组织事务吗？",
          "qId": "Basic_25Q2_q101"
        },
        {
          "qTitle": "What kind of lists do you make?",
          "qRewrite": "What types of information do you typically organize through list-making?",
          "qTitle_cn": "您通常制作哪些类型的清单？",
          "qId": "Basic_25Q2_q102"
        },
        {
          "qTitle": "Do you make lists on your phone?",
          "qRewrite": "How do you utilize digital tools for list management?",
          "qTitle_cn": "您会使用手机制作清单吗？",
          "qId": "Basic_25Q2_q103"
        },
        {
          "qTitle": "Why do some people like to make lists?",
          "qRewrite": "What motivates individuals to engage in list-making practices?",
          "qTitle_cn": "您认为人们为什么喜欢制作清单？",
          "qId": "Basic_25Q2_q104"
        }
      ]
    },
    {
      "topicName_real": "Photograph",
      "topicName_rewrite": "Visual Documentation",
      "topicName_cn": "视觉记录",
      "topicId": "Basic_25Q2_t25",
      "questions": [
        {
          "qTitle": "Do you like taking photographs?",
          "qRewrite": "What is your attitude towards photographic documentation?",
          "qTitle_cn": "您喜欢拍摄照片吗？",
          "qId": "Basic_25Q2_q105"
        },
        {
          "qTitle": "Do you like taking selfies?",
          "qRewrite": "How do you view the practice of self-photography?",
          "qTitle_cn": "您对自拍这种形式有什么看法？",
          "qId": "Basic_25Q2_q106"
        },
        {
          "qTitle": "Do you prefer to take photos of people or of scenery?",
          "qRewrite": "What subjects do you prioritize in your photographic composition?",
          "qTitle_cn": "在拍摄主题上，您更偏好人物还是风景？",
          "qId": "Basic_25Q2_q107"
        },
        {
          "qTitle": "How do you keep your photos?",
          "qRewrite": "What methods do you employ for photo preservation and organization?",
          "qTitle_cn": "您如何保存和整理照片？",
          "qId": "Basic_25Q2_q108"
        }
      ]
    },
    {
      "topicName_real": "Cooking",
      "topicName_rewrite": "Culinary Activities",
      "topicName_cn": "烹饪活动",
      "topicId": "Basic_25Q2_t26",
      "questions": [
        {
          "qTitle": "Do you like cooking?",
          "qRewrite": "What is your general attitude towards preparing meals?",
          "qTitle_cn": "您喜欢烹饪吗？",
          "qId": "Basic_25Q2_q109"
        },
        {
          "qTitle": "Do you cook often?",
          "qRewrite": "How frequently do you engage in meal preparation?",
          "qTitle_cn": "您经常下厨吗？",
          "qId": "Basic_25Q2_q110"
        },
        {
          "qTitle": "How did you learn to cook?",
          "qRewrite": "What was your journey in acquiring culinary skills?",
          "qTitle_cn": "您是如何学习烹饪的？",
          "qId": "Basic_25Q2_q111"
        },
        {
          "qTitle": "Do you think cooking is important?",
          "qRewrite": "How do you view the significance of culinary skills in daily life?",
          "qTitle_cn": "您认为烹饪技能的重要性如何？",
          "qId": "Basic_25Q2_q112"
        }
      ]
    },
    {
      "topicName_real": "Praise",
      "topicName_rewrite": "Recognition and Appreciation",
      "topicName_cn": "表扬与赞赏",
      "topicId": "Basic_25Q2_t27",
      "questions": [
        {
          "qTitle": "Do you often praise others?",
          "qRewrite": "How frequently do you express appreciation for others' achievements?",
          "qTitle_cn": "您经常表扬他人吗？",
          "qId": "Basic_25Q2_q113"
        },
        {
          "qTitle": "What do you feel when others praise you?",
          "qRewrite": "How do you respond emotionally to receiving recognition?",
          "qTitle_cn": "当收到他人的表扬时，您有什么感受？",
          "qId": "Basic_25Q2_q114"
        },
        {
          "qTitle": "Who praises you the most?",
          "qRewrite": "From which individuals do you typically receive the most recognition?",
          "qTitle_cn": "谁最经常表扬您？",
          "qId": "Basic_25Q2_q115"
        },
        {
          "qTitle": "Do you think praise is important?",
          "qRewrite": "How do you view the significance of verbal recognition in personal development?",
          "qTitle_cn": "您认为表扬的重要性如何？",
          "qId": "Basic_25Q2_q116"
        }
      ]
    },
    {
      "topicName_real": "Phone",
      "topicName_rewrite": "Mobile Device Usage",
      "topicName_cn": "手机使用",
      "topicId": "Basic_25Q2_t28",
      "questions": [
        {
          "qTitle": "At what age did you get your first phone?",
          "qRewrite": "When did you first acquire a mobile device?",
          "qTitle_cn": "您在什么年龄获得第一部手机？",
          "qId": "Basic_25Q2_q117"
        },
        {
          "qTitle": "How long do you spend on your phone everyday?",
          "qRewrite": "What is your daily duration of mobile device usage?",
          "qTitle_cn": "您每天使用手机的时间有多长？",
          "qId": "Basic_25Q2_q118"
        },
        {
          "qTitle": "What do you usually do on your phone?",
          "qRewrite": "Which activities dominate your mobile device usage?",
          "qTitle_cn": "您通常用手机做什么？",
          "qId": "Basic_25Q2_q119"
        },
        {
          "qTitle": "Do you think you spend too much time on your phone?",
          "qRewrite": "How do you evaluate your mobile device usage patterns?",
          "qTitle_cn": "您认为自己花在手机上的时间是否过多？",
          "qId": "Basic_25Q2_q120"
        }
      ]
    },
    {
      "topicName_real": "Staying up",
      "topicName_rewrite": "Late Night Activities",
      "topicName_cn": "熬夜活动",
      "topicId": "Basic_25Q2_t29",
      "questions": [
        {
          "qTitle": "Do you often stay up late?",
          "qRewrite": "How frequently do you extend your activities into late night hours?",
          "qTitle_cn": "您经常熬夜吗？",
          "qId": "Basic_25Q2_q121"
        },
        {
          "qTitle": "What do you do when you stay up late?",
          "qRewrite": "What activities typically occupy your late night hours?",
          "qTitle_cn": "熬夜时您通常做什么？",
          "qId": "Basic_25Q2_q122"
        },
        {
          "qTitle": "How do you feel when you stay up late?",
          "qRewrite": "What physical and mental effects do you experience from late night activities?",
          "qTitle_cn": "熬夜时您有什么感受？",
          "qId": "Basic_25Q2_q123"
        },
        {
          "qTitle": "Do you think staying up late is bad for health?",
          "qRewrite": "How do you view the health implications of regular late night activities?",
          "qTitle_cn": "您认为熬夜对健康有什么影响？",
          "qId": "Basic_25Q2_q124"
        }
      ]
    },
    {
      "topicName_real": "Spending time by yourself",
      "topicName_rewrite": "Personal Solitude",
      "topicName_cn": "独处时光",
      "topicId": "Basic_25Q2_t30",
      "questions": [
        {
          "qTitle": "Do you like spending time by yourself?",
          "qRewrite": "How do you feel about periods of solitude?",
          "qTitle_cn": "您喜欢独处的时光吗？",
          "qId": "Basic_25Q2_q125"
        },
        {
          "qTitle": "How do you usually spend time by yourself?",
          "qRewrite": "What activities do you engage in during solitary moments?",
          "qTitle_cn": "独处时您通常做什么？",
          "qId": "Basic_25Q2_q126"
        },
        {
          "qTitle": "Do you think it is important to spend time alone?",
          "qRewrite": "How do you view the significance of solitary time in personal development?",
          "qTitle_cn": "您认为独处时间的重要性如何？",
          "qId": "Basic_25Q2_q127"
        },
        {
          "qTitle": "Do you spend more time by yourself than you used to?",
          "qRewrite": "How has your pattern of solitary time evolved over the years?",
          "qTitle_cn": "与以前相比，您独处的时间是否增加了？",
          "qId": "Basic_25Q2_q128"
        }
      ]
    },
    {
      "topicName_real": "Text messages",
      "topicName_rewrite": "Digital Communication",
      "topicName_cn": "短信交流",
      "topicId": "Basic_25Q2_t31",
      "questions": [
        {
          "qTitle": "Do you often send text messages?",
          "qRewrite": "How frequently do you engage in text-based communication?",
          "qTitle_cn": "您经常发送短信吗？",
          "qId": "Basic_25Q2_q129"
        },
        {
          "qTitle": "When do you send text messages?",
          "qRewrite": "In what situations do you typically resort to text messaging?",
          "qTitle_cn": "您通常在什么情况下发送短信？",
          "qId": "Basic_25Q2_q130"
        },
        {
          "qTitle": "Do you prefer sending text messages or making phone calls?",
          "qRewrite": "How do you prioritize between written and verbal communication methods?",
          "qTitle_cn": "相比之下，您更喜欢发短信还是打电话？",
          "qId": "Basic_25Q2_q131"
        },
        {
          "qTitle": "Have you ever received a text message from a stranger?",
          "qRewrite": "What has been your experience with unsolicited text communications?",
          "qTitle_cn": "您是否收到过陌生人的短信？",
          "qId": "Basic_25Q2_q132"
        },
        {
          "qTitle": "Do you think people send too many text messages?",
          "qRewrite": "What are your views on the current prevalence of text-based communication?",
          "qTitle_cn": "您认为人们发送短信的频率是否过高？",
          "qId": "Basic_25Q2_q133"
        }
      ]
    }
  ]
}