1. Do you think there are more beautiful things now than in the past? Why?
2. What beautiful scenery spots are there in your country?
3. Where do you think people usually come into contact with beautiful things?
4. Why do you think people enjoy visiting beautiful places?

1. Do young people like to do sports?
2. What are the benefits of sports for young people?
3. ls it necessary to build public sports spaces?
4. What do you think of companies donating sports venues for poor children?

1. What do you do if you disagree with someone?
2. How can we stop an argument from escalating into a fight?
3. Who do you think should teach children to respect their teacher?
4. What disagreements do parents and children usually have?

1. What are the differences between buildings in the city and in the countryside?
2. Do you prefer to live in the city or in the countryside?
3. What safety risks are there in residential buildings in cities?
4. ls it expensive to decorate a house or an apartment in the place where you live?

1. What outdoor activities are popular in China?
2. Are those people who like dangerous activities more likely to be successful?
3. Do you think it's better for people to change jobs when there are new chances?
4. Should young people try as many new activities as possible?
Many

1. What programs do people like to watch in your country?
2. Do people in your country like to watch foreign TV programs?
3. What's the benefit of letting kids watch animal videos rather than visiting zoos?
4. Do teachers play videos in class in your country?

1. Why do some people like to record important things with photos?
2. What can people learn from historical photographs?
3. ls taking photos the best way to remember something?
4. What do you think of beautified selfies?

1. Do you think online shopping will replace in-store shopping in the future? Why?
2. Why is fashion very important to some people?
3. Are older people as fashionable as young people? why?
4. Are women more fashionable than men? Why?

1. Do people in your country like to take public transportation?
2. Why do some people like a slow-paced life?
3. Is being patient good for people? Why?
4. Are people less patient now than people in the past? Why?

1. How does technology help people tell stories?
2. Do you prefer to read e-books or paper books?
3. Why are mystery novels so popular nowadays?
4. What kinds of stories do children like?

1. Are there many people growing their own vegetables now?
2. Do you think it's good to let kids learn how to plant?
3. What do you think of the job as a farmer?
4. What are the differences between traditional and modern agriculture?

1. How do people who are busy remember things they need to do?
2. Do you think people should remember family history?
3. If someone doesn't really like whom they are going to meet, they may deliberately forget their appointment, is that true? Why?
4. Which is more important, a work-related appointment or an appointment with a friend? Why?

1. Do you think we should use plastic products?
2. How can we reduce our use of plastic?
3. What kinds of plastic waste are often seen in your country?
4. Why do people like to use plastic products?

1. Do you still keep in touch with your friends from childhood? Why or why not?
2. How important is childhood friendship to children?
3. What do you think of online social media?
4. Do you think online social media will replace face-to-face communication?

1. Where and how can we get to know people of different cultures better?
2. What are the advantages and disadvantages of cultural diversity?
3. How can traditional culture and other cultures coexist?
4. Which traditions are disappearing?

1. Where do people normally watch movies?
2. What are the differences between watching movies at home and in a cinema?
3. Are actors or actresses important to movies? Why?
4. Why are there fewer people going to the cinema to watch movies nowadays?

1. How can people search for information now?
2. What information can people get from television?
3. Do you think libraries are still important in the digital age?
4. Does the development of the Internet have any impact on some disadvantaged people?

1. Why do people learn foreign languages?
2. What makes a good foreign language teacher?
3. Do you think grammar is important when learning foreign languages?
4. ls it interesting to be a foreign language teacher? Why?

1. What kind of customer service do you think is good?
2. What are the differences between shopping online and in-store?
3. What problems do customers often have while shopping?
4. What do you think customers should do when there are problems with products bought online?

1. Do you think kids like to share? Why?
2. How can parents teach their children to share?
3. What do you think is the benefit of sharing for children?
4. ls there anything that parents should persuade children to share with others?

1. Why do people rarely use cash now?
2. When do children begin to comprehend the value of money?
3. Should parents reward children with money?
4. ls it good and necessary to teach children to save money?

1. ls it important to take photos while traveling?
2. Can you trust other people's travel journals on the Internet?
3. What factors affect how people feel about travel?
4. Will people go to a foreign country to travel because of the distinct landscape?

1. What can children learn from parents?
2. Do you think some children are well-behaved because they are influenced by their parents?
3. ls it necessary for adults to learn new things?
4. How can people learn new things?

1. Should people set goals for themselves?
2. How do you define success?
3. How do we judge whether young people are successful?
4. Are successful people lonely?

1. What qualities make a role model?
2. What types of people will inspire children to do interesting things?
3. Who do you think will inspire children more: parents or teachers?
4. Should adults encourage young children to set their own goals?

1. Should teachers be funny when they teach?
2. What qualities should teachers have?
3. Which do you think is more important, practical skills or academic skills?
4. Which age group is the best at learning new things?

1. Are smart people happier than others?
2. Do you think people tend to be selfish?
3. Who do you think plays a more important role in a child’s development, teachers or parents?
4. Why are some children more intelligent than others?

1.What do you think of making friends online?
2.Is it a good idea to make friends with people who are much older than you?
3.Do the people in your country enjoy meeting new people?
4.Do you think friendship is important?
5.Why is it difficult for some people to make friends with others?
6.Do we benefit from having friends with different personalities?

1.What impact does advertising have on children and their parents?
2.What do parents often persuade their children to do?
3.Who do children listen to more, their parents or their teachers? Why?
4.What are the good ways to persuade children?
5.What advice should young people follow?

1.What kind of plans do young people often make?
2.Why can't people always follow their plans?
3.Why do people make plans?
4.Is it important to make plans？
5.Why do some people like to make plans wholesome others don't like to?
6.Are there any people who never make plans?

1. What bad behavior do children usually have?
2. How should parents stop their children from behaving badly in public?
3. Are parents these days stricter than those in the past?
4. Whose influence on children is more important? Friends’ or parents’?

1. Should kids know more about stars and planets?
2. Is high technology helpful for star watching? 
3. What kind of people are interested in stars?
4. Why do some people like to watch movies about stars or planets?

1.Where do we often see advertisements?
2.What are the benefits of advertising?
3.Are advertisements good or bad for children?
4.How does advertising affect people?
5.Do people pay attention to advertisements on public transport?
6.Do you think it is good to see the same advertisements everywhere?

1.Do people in your country go to the shopping mall frequently?
2.How have people's shopping habits changed in recent decades?
3.Do you think shops and shopping malls will disappear in the future?
4.What are the differences between shopping in street markets and big shopping malls?
5.What are the differences in the shopping habits of different age groups?
6.What are the differences between shopping online and in-store?

1. Do people like comedy?
2. Why do people of all ages like cartoons?
3. Why do some people like to make others laugh?
4. Should teachers tell jokes in class?

1.Some people think it's a waste to buy too many clothes for children. What do you think?
2.How do people usually handle the clothes they don't want?
3.Why do people buy second-hand clothes?
4.What problems will occur if people don't recycle?
5.Should the government encourage people to recycle items?
6.How do people in your country recycle various items they don't want?

1. Do you think what people wear can influence their mood?
2. Do you think it is a good idea to buy clothes online?
3. What kind of clothes do people wear in the workplace?
4. What are the differences between clothes worn by old people and that by young people?

1. What age do young children start to have their own opinions?
2. What kinds of things do children have strong opinions about?
3. Should parents always consider their children’s opinions?
4. In which kinds of job are excellent communication skills essential?
5. What is the importance of having good listening skills?
6. How easy it is for people to improve their communication skills?

1. Is it hard to find quiet places in cities?
2. Are there more or less quiet places compared to the past?
3. What kinds of thing can make noise?
4. Do you think how noises in cities could be reduced?
5. What do you think are the negative effects of noise pollution?
6. Do you think whether noises could be eliminated in the future?

1.Do people in your country set goals?
2.Do people usually set long-term goals or short-term ones?
3.Why is setting goals important in the workplace?
4.What is the difference between goals set by old people and young people?
5.How do people set goals?
6.Do you think people should have personal life goals?

1. What’s the difference between the city and the country?
2. Some people say large cities are suitable for old people. What do you think?
3. Do you think it is possible that all of the population move to cities?
4. Do you think people in the countryside are friendlier than people in the city?

// 42. 看到动物的地方
// 43. 别人帮助下做的重要决定
// 44. 跟老人的有趣谈话
// 45. 一件特殊的衣服

1. What kind of music is popular in China now and what kind will be in the future?
2. Why do some people like to listen to live music while others prefer CDs?
3. Do Chinese parents require their children to learn to play musical instruments?
4. How do you think the government could support very talented musicians?
5. Do you think it is valuable to hold international music events?
6. Do you think a country's music can boost its international reputation?

1.What are the differences between indoor sports and outdoor sports?
2. Which outdoor sports are popular in China?
3.Which sports are popular among elderly people?
4.Which outdoor sports are popular with children?
5. How do weather affect outdoor sports?
6.Which sports can children do on rainy days?

1.What kinds of sports events are broadcast on TV or other media in your country?
2.Do people in your country enjoy watching football games?
3.Does encouragement and applause from the audience have an impact on athletes?
4.Do you prefer to watch live sports or watch it on TV?
5.Why do some people like to watch live sports?
6.What kinds of sports do Chinese people like to watch?
7.Do you think competition is good for students?

1. What can governments do to improve people’s health?
2. How can people keep fit?
3. How can you tell whether a website is reliable or not?
4. Do you think people are healthier now than in the past?
5. Who should be responsible for the exaggerated claims that are on the supplement packaging?
6. How much healthier people are nowadays compared to those in the past?

1. Do you think arguments are important?
2. What do family members usually have arguments about?
3. Is it easier for you to have arguments with your family or with your friends?
4. Do you think people should change the way they think when having arguments?