Describe something that surprised you and made you happy. 
Some instructions that you can follow: 
What the surprise was 
How you found out about the surprise 
What you did after you found out 
And explain why the surprise made you happy.

Describe an occasion when you lost something in a public place 
Some instructions that you can follow: 
What you lost 
When and where you lost this thing 
What you did to try and find it 
And explain how you felt about it

Describe a change you made in your daily life that saved you a lot of time.
Some instructions that you can follow:
What the change was
When you made this change
How easy it was to make this change
And explain how making this change in your daily life saved you a lot of time.

Describe an invention which you think has changed the world in a good way.
Some instructions that you can follow:
What this invention is
What it does
How popular it is with people of different ages
And explain how you think this invention has changed the world in a good way.

Describe a time when you helped child.
Some instructions that you can follow:
Who the child was
When you helped the child
How you helped the child
And explain how you felt about it.

Describe an occasion when someone said something positive about some work that you did.
Some instructions that you can follow:
Who it was
What kind of work you did
Why this person was positive about your work
And explain how you felt about it

Describe an interesting neighbor.
Some instructions that you can follow:
Who the neighbor
How you met this neighbor
How often you see this neighbor
And explain why you find this neighbor interesting.

Describe a friend you enjoy talking with.
Some instructions that you can follow:
How you first met this friend
What kind of person this friend is
What you talk about with this friend
And explain why you enjoy talking with this friend.

Describe a time when you were very busy.
Some instructions that you can follow:
When it was
Why you were so busy
What you did to deal with the situation
And explain how you felt about being so busy.

Describe an important event that you celebrated.
Some instructions that you can follow:
What it was
Who celebrated the event with you
How you celebrated
And explain why the event was important to you.

Describe a time when you used a phone to do something important.
Some instructions that you can follow:
When and where you used the phone
What you used the phone for
Why it was important to do this
And explain what happened as a result of using the phone.


Describe a time when you had to spend a long time in a traffic jam.
Some instructions that you can follow:
When and where it happened
What you did
How you felt about it
And explain what problems the delay caused you.

Describe a difficult decision you made that had a very good result.
Some instructions that you can follow:
What it was
Why it was difficult to make the decision
What helped you to decide
And explain why the decision you made had such a good result.

Describe a change you made recently that was positive.
Some instructions that you can follow:
What it was
Why you decided to make this change
Whether other people helped you
And explain why it was a positive change

Describe something you do that you think is important for keeping fit and healthy.
Some instructions that you can follow:
What you do
How often you do it
Who you do it with
And explain why you think this activity is important for keeping fit and healthy.


Describe something that helps you to concentrate on work/study.
Some instructions that you can follow:
What do you do
Whether you always do the same thing
Where and when you do this
And explain how much this helps you to concentrate on work/study.

Describe a time when someone asked you for opinion.
Some instructions that you can follow:
Who asked you
Why this person wanted to know your opinion
What opinion you gave
And explain how you felt about it

Describe an ambition you haven’t achieved yet.
Some instructions that you can follow:
What it is
Why you want to achieve this ambition
How long you have had this ambition
And explain why you haven’t achieved this ambition yet.

Describe a quiet place where you like to spend time.
Some instructions that you can follow:
Where it is
How you found it
How often you spend time in this quiet place
And explain why you like spending time in this quite place.

Describe a special day out which didn’t cost very much.
Some instructions that you can follow:
Where and when you went
What you did
What the you spent money on
And explain why you enjoyed this special day out.

Describe a long walk that you enjoyed.
Some instructions that you can follow:
Where and when you did
Who you went with
What you saw on the walk
And explain why you enjoyed this long walk

Describe a place in the countryside that you enjoyed visiting.
Some instructions that you can follow:
Where you went
Why you went to this place
What you saw and did there
And explain why you enjoyed visiting this place in the countryside.

Describe a time that you remember being in a new place.
Some instructions that you can follow:
Where you were
Why you went there
What you remember about it
And explain how you felt about being in this new place.

Describe a time when you were preparing for a happy event .
Some instructions that you can follow:
What it was
How you prepare for this event
Who helped you prepare
And explain how successful your preparations were.

Describe a well-known person in your country who is very popular.
Some instructions that you can follow:
Who this person is
What you know about this person
Why he/she is so popular
And explain how you feel about this person being so popular.

Describe a person you know who does a job which is useful to society.
Some instructions that you can follow:
Who this person is
What job this person does
What skills this person needs to do the job
And explain why you think this job is useful to society.

Describe a place you have visited that you would recommend as a good place to live.
Some instructions that you can follow:
Where this place is
How well you know this place
What people can do in this place
And explain why you would recommend.

Describe a famous city that you find interesting.
Some instructions that you can follow:
Where the city is
How you know about it
Why the city is famous
And explain why you find this city interesting.

Describe a traditional product made in your country which you like.
Some instructions that you can follow:
What it is
When you first tried this product
How this product is made
And explain why you like this traditional product.


Describe a toy that you often played with as a child.
Some instructions that you can follow:
What kind of toy it was
When did you get the toy
Whether you played with the toy by yourself or with other people
And explain how you felt about this toy

Describe something you did that helped you to learn another language.
Some instructions that you can follow:
What you did
Where you did it
Who you did it with
And explain how doing this helped you to learn another language.

Describe a person you follow on social media.
Some instructions that you can follow:
Who this person is
How you know about this person
What kinds of things he/she talks about
And explain why you follow this person regularly on social media or other media.

Describe a story someone told you that you remember well.
Some instructions that you can follow:
Who told you the story
When this person told you
What the story was about
And explain why you remember it well

Describe an interesting discussion that you had with friends.
Some instructions that you can follow:
What it was about
What did you and your friend talked about
What the result of the discussion was
And explain why you found this discussion was.

Describe a person you only met recently who you would like to get to know better.
Some instructions that you can follow:
Who this person is
Where you met him/her
What you talked about
And explain why you would like to know this person better

Describe a person that you enjoy spending time with.
Some instructions that you can follow:
How you met him/her
What type of person he/she is
What you did you do with him/her together
And explain why you enjoy spending time with this person.

Describe something you can’t live without – not a mobile/cell phone or computer.
Some instructions that you can follow:
What it is
How long you have had it
What you used for it
And explain why you can’t live without this thing.

Describe a time when something in your home broke and you tried to repair it.
Some instructions that you can follow:
What thing broke
Why this thing broke
What you did to try to repair it
And explain how successful you were at trying to repair this thing.

Describe a rule (e.g. at school or work) you dislike and would like to change.
Some instructions that you can follow:
What it is
What the reason for the rule is
Why you don’t like the rule
And explain how you would like to change the rule.

Describe an item of clothing that someone gave you.
Some instructions that you can follow:
What the item of clothing was
Who gave it to you
What it looked like
And explain why this person gave it to you

Describe a lesson that you remember well.
Some instructions that you can follow:
What the lesson was about
When and where this lesson took place
What happened
And explain why you remember this lesson so well

Describe a time when you had a cake that was special.
Some instructions that you can follow:
What kind of cake it was
Why you had this cake
When you had this cake
And explain how you felt about having this special cake.

Describe a time when you received something without having to pay for it
Some instructions that you can follow:
What it was
Why it was free
What you did to get this free thing
And explain how you felt about it

Describe a gift you would like to buy for a friend
Some instructions that you can follow:
How do you know this friend
What kinds of gift you would like to buy
How much time you spend with him/her
And explain why you would like to buy this gift for him/her

Describe a useful skill you learned from an older person.
Some instructions that you can follow:
Who this person was
What skill you learned
How easy or difficult it was to learn this skill
And explain why it was useful for you to learn this skill

Describe a song that you think is interesting.
Some instructions that you can follow:
What country the song is from
How you know about it
What the song is about
And explain why you think this song is interesting.

Describe the kind of house or apartment you would like to live in.
Some instructions that you can follow:
Where it would be
What it would look like
What would be special about
And explain why you would like to live in this house or apartment

Describe a family member you might like to work with in the future.
Some instructions that you can follow:
Who this person is
Whether you have worked with this person before
What kind of work you might like to do with this person
And explain why you might like to work with this family member in the future.

Describe an important river, lake or area of water in your country.
Some instructions that you can follow:
Where in your country it is
How big it is
What it looks like
And explain why it is important for your country.

Describe a competition you would like to take part in.
Some instructions that you can follow:
What it is
Where and when it happens
What you have to do to win the competition
And explain why you would like to take part in this competition.