How can parents help their children to be ready for anything? 
What are some instances where it is beneficial for someone to be well prepared? 
What can assist people in getting ready for a regular work or study day? 
Is being well organized something people are born with?

What are the high-paying jobs in your country?
Should young individuals receive the same pay as older individuals?
What types of jobs do not pay enough? 
What can high schools do to prepare their students for work?
Is university a good place to learn about the world of work?

Who do people spend the most time with in their everyday lives?
How important is it to spend time with different kinds of people?
How should managers treat their employees?
In what ways do people's behaviors change when they are with an older person?

Do boys and girls prefer different kinds of toys?
How do toys that were popular in the past compare with toys that are popular now?
What should people consider when choosing a toy for a child?
Should kids be permitted to pick their own toys at a toy store?
Do children like playing with household items?
What are the reasons why some parents purchase many toys for their children?

What are some things that are difficult to choose for other people?
What do people need to consider when buying a gift for another person?
Do parents occasionally purchase excessive gifts for their children?
On which occasions is it crucial to give gifts?
Is there too much pressure to give expensive gifts on special occasions?

What are the most difficult things about learning a new language?
How easy it is for younger and older people to learn a language?
What are the most effective methods for learning a language?
What are the advantages of learning a foreign language?
Is speaking other languages more significant today than it was in the past?
How may learning a new language change people’s view of their own society?

When do people in China consume special types of food?
Do you believe that food for special occasions should differ from everyday food?
Why do some people spend a lot of time on food for special occasions?
What is the importance of meals as an opportunity for families to communicate?
Why do some individuals cook less now than people did in the past?
Is there more high-quality food available now than in the past?

What types of things can people easily fix on their own?
Why it is sometimes not a good idea to pay for a repair?
When is it better to seek an expert to repair something?
Do you think some companies only intend for their products to last for a short time?
Are luxury brands always better quality than cheaper brands?

What kinds of children’s stories are popular in China?
What stories do younger children and older children like?
How is technology used in storytelling today?
Why do children like listening to stories?
Is reading stories better for a child’s imagination than watching stories on TV/film?

What are the most popular types of homes where you live?
What are the advantages and disadvantages of owning a home?
Do young and old people like the same types of houses?
Do people in China generally rent or buy their home?
Should governments be responsible for ensuring there is enough housing for the population to buy?

What difficulties can people have when they start working at a new company?
How do most children feel on their first day at a new school?
What are the reasons why many students relocate to a new city or country to study?
Is it important to gather a lot of information about a new place before traveling there?
Why do so many people enjoy travelling to new places?
Are there any possible negative impacts of frequent international travel to new places?

What are the various types of music popular among young people in China?
Do older individuals enjoy the same kind of music as young people?
Are the words of a song more important than the music?
Why are singing competitions on TV popular in some countries?
What is the difference between the experience of going to live concerts and watching concerts on TV.

What kinds of ambitions do children often have when they are young?
How crucial is it for children to have ambitions?
May being too ambitious not be good for children?
What qualities are needed for ambitious people to succeed in the workplace?
Can it sometimes cause problems if people are ambitious at work?

Why do schools need to have rules?
What types of rules do children often have to follow at home?
Do you believe that everyone likely breaks a law at some point in their life?
What types of penalties are suitable for minor offenses?
Are there more rules for children nowadays than in the past?
Is it always wrong to break the law?

What are some reasons young people want to have the latest technology?
Why do some people find it difficult to throw or give anything away?
In what ways does the media influence people’s decisions about what they buy?
Why do children often have a favorite toy they take everywhere?
Is there now too much choice when people buy products?
Why do some people buy things they really do not need?

Why do children often enjoy learning things from older people?
What types of things can children learn from older individuals such as grandparents?
Do children learn more effectively from adults who are not their parents?
What kinds of assistance do older people require?
Who benefits more – the older people or the people who help them?

What is the importance of outdoor activities in helping children develop?
What are the most popular outdoor recreational activities in China?
What is the difference between outdoor activities people do now and those they did in the past?
What makes leisure activities crucial for individuals of all age groups?
Do women today have less time for leisure than men?

Does technology mean people don't need to remember things?
What things do people often keep when they want to remember events in their lives?
What types of things do people need to remember every day?
Why are some individuals better at remembering things than others?
Do words or pictures help people to remember things more?
Why do two people sometimes remember the same event in different ways?

What are the advantages and disadvantages of uniforms for work and school?
Why do some people wear different kinds of clothes for leisure and for work?
What can people learn about someone from his or her clothing?
On what occasions do some people wear traditional national costumes?
Will everybody wear the same types of clothes in the future?
Why do people in different parts of the world wear different types of clothes?

At what age do young children start to form their own opinions?
Should parents always consider their children's opinions?
In which kinds of job are excellent communication skills essential?
What kinds of things do children have strong opinions about?
What is the importance of having good listening skills?
How easy is it for people to improve their communication skills?

What types of items do businesses distribute as complimentary gifts?
What are some reasons that businesses provide free gifts?
Do people always feel happy when they receive a free gift?
What types of free services should the government provide to all citizens?

What various forms of media are popular in your country?
Are the same types of media important to young and old people?
What are the primary reasons that people use social media?
It is difficult to get to know someone well through social media?

What advantages do cities gain from having many tourists?
What kinds of things do tourists like to do in cities?
What are the drawbacks for residents living in cities that attract many tourists?
Why do many young people feel connected to urban life?

What are the most favored destinations in the countryside for people in your area to explore?
Do people travel to the countryside more now than they did in the past?
Why do some people choose to live in the countryside?
What’s the disadvantages of living in the countryside?
Who is likely to enjoy a visit to the countryside?

How do people behave in polite ways when meeting new people?
Are there any good ways to meet new people in your country?
What are the most important qualities in a good friend?
Why do you believe it is important to share similar interests when forming new friendships?
Do people tend to form their strongest friendships while in school?
How might the internet influence friendships in the future?

What adjustments do people typically make in their everyday routines?
Do young people like making changes in their daily routines more than older people?
Is it beneficial for people to continue making changes to their daily routines?
Is it a good idea for people to change job regularly?
How can working in another country change a person’s view of the world?
Is being promoted at work always a change for the better?

How well do people usually know their neighbors in China?
What are the advantages of living in a place where neighbors know each other well?
Is it harder for neighbors to get to know each other in big cities?
What are some ways that businesses can support local communities?
What are things that people can do to make their neighborhood a good place to live?

What kinds of help people can give their neighbors?
How do schools motivate young people to assist others?
Do you think people naturally want to help others?
Should everyone volunteer in their community?
What is the importance of volunteering time and donating money to support people in need?
Who benefits more – the volunteers or the people they help?

Why do some people not like giving their opinion?
What are some professions where people frequently need to share their opinions?
Do people give their opinions about products and services more frequently nowadays?
What are the kinds of things people often write about in online reviews?
Do people tend to express their opinions more forcefully online compared to in person?

Is technology bad for children’s concentration?
Which types of jobs is being able to concentrate particularly important?
Why is it important for children to learn to concentrate?
Why is it important for children to focus while participating in sports?
Why may some people find it difficult to concentrate at work?
What actions can employers take to assist their employees in maintaining concentration?

How can people have an enjoyable day without leaving home?
How does the weather affect people's enjoyment when going out?
What is the difference between going out alone and going out with friends?
How important is spending money in making a day out enjoyable?
Where are places people in China go for a day out?

Do you think urban traffic will become worse in the future?
When is traffic usually the heaviest during the day in most cities?
Do highways make traffic flow more smoothly?
How can public transportation help ease traffic jams?

How difficult is it to find a quiet place in big cities?
Are houses today louder compared to the past?
Do older people like quiet places more than younger people?
Why do a lot of people like having some noise while studying or working?
What are some problems that noisy neighbors can cause?

When is it appropriate for parents to give their children positive encouragement?
Is it possible to give too much encouragement to children?
Why is encouragement important for children?
When might people say positive things that they do not mean?
What is the importance of positive and negative feedback on how people work?
Why do some people tend to believe positive remarks about themselves more than negative ones?

What are some types of traditional items produced in China?
Why is it important for people to understand their country's traditions?
Whether young people should be taught about traditions at home or at school?
Traditional products are generally better quality than modern ones?
In what ways can traditional products benefit a country’s tourism industry?

What topics do young people usually discuss with their friends?
Why is it important to listen attentively when conversing with friends?
What are some common situations where people need to speak with strangers?
Why do some people find it difficult to talk to people they don’t know?
Do people communicate with strangers in the same manner as they do with friends?

Are younger people or older people better at managing their time?
What are some methods people use to save time in their daily lives?
Should schools teach children to manage their time?
Do people tend to waste a lot of time these days?
Are those who learn to manage their time effectively more successful in life?
Does using technology always make it easier to manage time?

What is the most helpful invention people have at home?
Does using household devices make people lazy?
What types of technology are most important in schools today?
What equipment might people like to have in the home in the future?
Can watching television programmes in class be a good way of learning?

What are some typical uses of phones in daily life?
How do young people and older adults use phones differently?
Is the most important use of a phone for calling people?
Is it acceptable to call someone late at night?

What are some ways people express happiness in your culture?
Is being happy beneficial for one's health?
Can shopping bring people happiness?
Is it possible for people to learn how to be happy?
How can someone's attitude toward life influence their level of happiness?
Can periods of unhappiness have positive results for some people?

What are some typical types of family businesses?
What are the benefits of working in a family business?
What are some reasons why it is better not to stay too long with one company?
Is working in a large company too impersonal?
What are the advantages of working for a large company?

What are the differences in the types of places preferred by older and younger people?
Why do some people choose to relocate to a different area?
What kinds of places do people prefer to live in?
What are some advantages for people living near their workplace?
What preparations should people make before moving to a new area?

Is it preferable to celebrate special occasions with a big group of people?
What can people do to ensure an event is successful?
What are the most important events in people’s lives?
How do people celebrate major national events?
Why is it important to remember national events?

What can people do to prevent losing their belongings?
What are some ways people can try to locate something they have lost?
What types of items do people frequently lose in public places?
Why do some people tend to lose things more often than others?
Why do people sometimes make a lot of effort to find something they have lost?

Why do people like spending time near water?
What are some popular types of water sports?
Why are rivers important for tourism?
What are the pros and cons of using rivers for transportation in cities?
Should all children have swimming lessons at school?
What sorts of jobs are associated with rivers?

Why are some children more well-liked than others at school?
What are the pros and cons of being popular at school?
Are students who are popular at school also popular as adults?
How important is it to be popular with colleagues at work?
Are people often promoted more for their popularity than for their ability?
Does a good boss need to be popular with his/her employees?

How easy it is to do exercise where you live?
What are some popular ways for people in your country to keep fit?
Where should young people engage in physical exercise at school?
What are some ways to provide adults with information about health issues?
Is there is too much advertising of unhealthy food on television?

What kinds of important decisions do young people have to make?
In what ways do peers influence the decisions teenagers make?
To what extent does advertising affect people's everyday decisions?
Who are the best people to help teenagers make important decisions?
Is it necessary to allow children of any age to make some decisions themselves?

What are some popular contests that regular people can participate in?
What types of people are most likely to take part in competitions?
Is it always a good idea to encourage competition at work?
Why are televised competitions becoming more popular?

Do children need long holidays from school?
Do very young children in your country work too hard at school?
Do young children learn more from playing than from classroom lessons?
What are the advantages and disadvantages of having a lot to do at work?
What does the impact of time pressure have on the quality of work people do?