{
    "real_questions": [
        {
            "topicName": "Where you live（New）",
            "questions": [
                "How long have you lived in the house or apartment you’re living in now?", 
                "What do you like about this house or apartment?", 
                "What kind of home would you like to live in in the future?"
            ]
        },
        {
            "topicName": "Work and Study（New）",
            "questions": [
                "What work do you do?",
                "How easy is it to get this kind of work in your country?",
                "How important is it to you to have work that you enjoy doing?"
            ]
        },
        {
            "topicName": "Hometown",
            "questions": [
                "Do you come from a city, town or village?",
                "What do you like about your home city/town/village?",
                "Is your home city/town/village a good place for young people?"
            ]
        },
        {
            "topicName": "Work and Study",
            "questions": [
                "Where do you work?",
                "How do you usually travel to work?",
                "How do you feel after you finish a day at work?"
            ]
        },
        {
            "topicName": "Advertisement",
            "questions": [  
                "Do you like to watch adverts on the internet or TV?",
                "Do you notice advertising in public places?",
                "Is there an advert that you remember well from in childhood?",
                "Would you like to work in advertising industry?"
            ]
        },
        {
            "topicName": "Crowded places（New）",
            "questions": [
                "When was the last time you went to a crowded place?",
                "Are there many crowded places where you live?",
                "Would you prefer to have a holiday in a crowded place, or a quiet place?",
                "Do people in your country often celebrate together?"
            ]
        },
        {
            "topicName": "Memory（New）",
            "questions": [
                "What do you need to remember to do every day?",
                "Have you ever forgotten to do something important?",
                "Is it easy to remember to do things?",
                "What do you do to help you remember to do things?"
            ]
        },
        {
            "topicName": "Colour（New）",
            "questions": [  
                "What colours do you like most?",
                "What colour of a car you would like to buy?"
            ]
        },
        {
            "topicName": "Famous people（New）",
            "questions": [
                "Do you enjoy receiving news about famous people?",
                "Would you like to be famous in the news?",
                "Do you believe the things you read about famous people?"
            ]
        },
        {
            "topicName": "Video games（New）",
            "questions": [
                "Have you ever played a video game in your childhood?",
                "Are you interested in watching other people play video games?",
                "Would you prefer to play a video game on your own?",
                "Do you think some people spend too much time playing video games?"
            ]
        },
        {
            "topicName": "Social media（New）",
            "questions": [
                "Do your friends and family use social media?",
                "Do you think people in your country find social media useful?",
                "Do you spend too much time on social media?",
                "When did you start using social media?"
            ]
        },
        {
            "topicName": "Sweet things（New）",
            "questions": [
                "Did you enjoy sweet things when you were a child?",
                "Have you ever made a cake yourself?",
                "How often do you eat something sweet after a meal?"
            ]
        },
        {
            "topicName": "Singing（New）",
            "questions": [  
                "Do you love singing songs?",
                "Have you learned to sing any songs when you were a child?",
                "Which singers do you like most?",
                "Do people in your country often sing songs?"
            ]
        },
        {
            "topicName": "Feeling bored（New）",
            "questions": [
                "Do you often feel bored?",
                "What sort of things do you find most boring?",
                "What do you do to keep yourself from getting bored?",
                "Are you bored more easily now than when you were younger?"
            ]
        },
        {
            "topicName": "Sunglasses（New）",
            "questions": [  
                "How often do you wear sunglasses?",
                "Would you buy sunglasses for your friends or family?",
                "Would you spend lots of money on sunglasses?",
                "Have you ever lost any sunglasses?"
            ]
        },
        {
            "topicName": "Stages in life（New）",
            "questions": [
                "What did you enjoy most about your childhood?",
                "What’s the best thing about being the age you are now?",
                "What do you want to do five years later?",
                "How can people remember all the different stages in their lives?"
            ]
        },
        {
            "topicName": "Money（New）",
            "questions": [  
                "Do you usually like to spend or save money?",
                "How often do you use a credit card to pay for things?",
                "Will you use cash more often in the future?",
                "What do you think about using apps to pay for things?"
            ]
        },
        {
            "topicName": "Music（New）",
            "questions": [
                "Do you like music?",
                "What kinds of music do you listen to?",
                "Is it easy to learn music?",
                "Do you learn music lessons at school?"
            ]
        },
        {
            "topicName": "Geography",
            "questions": [      
                "Did you like to study geography at school?",
                "Is what you learned in geography very useful to you now?",
                "Would you like to be a geography teacher?",
                "Are you interested in finding out more about the geography of other countries?"
            ]
        },
        {
            "topicName": "Fishing",
            "questions": [
                "Is fishing popular in your country?",
                "How do you feel about eating fish?",
                "Have you ever visited a place where you saw lots of fish?",
                "Would you ever watch a TV programme or film about fish?"
            ]
        },
        {
            "topicName": "Helping others",
            "questions": [  
                "What kind of help do you give to other people?",
                "Did your family encourage you to be helpful when you were a child?",
                "Do you like to help people?",
                "When was the last time someone helped you?" 
            ]
        },
        {
            "topicName": "Gifts",
            "questions": [  
                "Have you ever received a really good present?",
                "Are you good at choosing presents for others?",
                "What kind of present would you buy for your friends?",
                "Have you ever given someone a present that you made yourself?"
            ]
        },
        {
            "topicName": "Tea or coffee",
            "questions": [
                "Do people like to drink tea and coffee in your country?",  
                "Do you ever go out to drink tea or coffee?",
                "Would you offer a visitor to your home tea or coffee?",
                "When was the last time you drank tea or coffee?"
            ]
        },
        {
            "topicName": "Running",   
            "questions": [
                "Did you do much running when you were a child?",
                "What do you think of running as a form of exercise?",
                "When was the last time you ran?",
                "Are there any good places for running near where you live?"
            ]
        },
        {
            "topicName": "Robots",
            "questions": [
                "How interested are you in robots?",
                "When you were a child, did you enjoy robot films?",
                "Would you like to have a robot to help you at home?",
                "Would you feel happy travelling in car with automatic driving?"
            ]
        },
        {
            "topicName": "Music",
            "questions": [
                "Do you know how to play any musical instruments?",
                "Have you learned about music at school?",
                "Do you think all children should have music lessons at school?",
                "Do you think it is easy to learn to play a musical instrument?"
            ]
        },
        {
            "topicName": "Clothes",
            "questions": [
                "Do you spend a lot of time deciding what to wear every day?",
                "Do you prefer comfortable clothes or smart clothes?",
                "Were you allowed to choose your own clothes when you were a child?",
                "What do you do with your clothes when you no longer use them?"
            ]
        },
        {
            "topicName": "Films",
            "questions": [
                "What’s your favourite kind of film?",
                "Did you often go to the cinema when you were young?",
                "Would you like to make a film yourself one day?",
                "Do you think watching films is a good way to spend time with friends?"
            ]
        },
        {
            "topicName": "Maps",
            "questions": [
                "Do you often use a map on your phone? How often?",
                "Have you ever used a paper map?",
                "Would you ever put a map on the wall in your home when you were a child?",
                "Do you find it easy to read maps?"
            ]
        },
        {
            "topicName": "Noise",
            "questions": [
                "What loud noise can you hear where you live?",
                "Would you like to live in a less noisy place?",
                "Do you think it's okay for people to make noise in public places?",
                "Do you enjoy listening to loud music?"
            ]
        },
        {
            "topicName": "Chatting",
            "questions": [
                "Do you often chat with your friends?",
                "Do you like chatting with your friends face-to-face or on social media?",
                "Do you like chatting with a group of friends or chatting with just one friend?",
                "Do you ever have disagreements with your friend when you are chatting?"
            ]
        }
    ]
}