Describe a person you know who likes to talk a lot. 
You should say: 
who this person is 
how you know this person 
what this person usually talk about 
and explain how you felt about him/her

Describe a person you know who works well in a team 
You should say: 
who this person is 
what kind of team he/she is in 
what this person does in the team 
and explain why you think this person works well in the team

Describe a person who you think is good at making visitors to his or her home feel welcome. 
You should say: 
who this person is 
how do you know him/her 
how he/she makes visitors feel welcome 
and explain why you think this person is good at this

Describe an interesting conversation you had with a very old person. 
You should say: 
who this person is 
when and where you had the conversation 
what you talked about 
and explain why your conversation was interesting.

Describe an interesting person who you have never met, but would like to know more about. 
You should say: 
who this person is 
how you heard about this person 
what interesting things he/she has done 
and explain why you'd like to know more about this person.

Describe a person who always has interesting ideas and opinions. 
You should say: 
who this person is 
how you knew this person 
what kind of ideas he/she has 
and explain why you think this person’s ideas and opinions are interesting.

Describe someone you studied with who is successful in his/her life. 
You should say: 
who this person is 
where you studied together 
when you studied together 
and explain why you think this person is successful in his/her life.

Describe a person you know about who runs a successful business. 
You should say: 
How do you know about this person 
What kind of business does he/she run 
How long has the business been running 
and explain why you think his/her business is successful.

Describe a person who enjoys cooking for others. 
You should say: 
who he/she is 
how you knew this person 
who he/she usually cooks for 
and explain why you think he/she enjoys cooking for other people. 

Describe a person from another culture who speaks Chinese very well. 
You should say: 
who he/she is 
which country does he/she come from 
how he/she learned your language 
and explain why you think this person speaks Chinese so well. 

Describe a successful sportsperson that you admire
You should say: 
who this person is 
what he/she has achieved 
what you know about his/her life 
and explain why you admire this sportsperson. 

Describe a time when you did an exciting activity with other people 
You should say: 
what the activity was 
where you did this activity 
why you did this activity 
and explain how you felt about it.

Describe a time when you went to a party that you enjoyed. 
You should say: 
when and where the party was held 
what/who the party was for 
what you did at the party 
and explain why you enjoyed it.

Describe an important journey you made where there was a delay. 
You should say: 
where you were going 
why the journey was important 
what caused the delay 
and explain what happened because of the delay.

Describe an unusual holiday you went on. 
You should say: 
who you went with 
where and when you went 
what you did there 
and explain why this holiday was unusual.

Describe an activity that you really enjoyed doing at primary school.
You should say: 
what it was 
who you did it with 
how often you did this activity 
and explain why you really enjoyed doing it

Describe a time when you went to a street market.
You should say: 
where it was 
why you go to there 
what you bought 
and explain how you felt about the experience of going to the street market.

Describe a skill you enjoyed learning as a teenager. 
You should say: 
what you learned to do 
how you learned to do it 
why you learned to do it 
and explain why you enjoyed learning this skill as a teenager.

Describe a time when you had to wear a uniform. 
You should say: 
when and where you wore 
who paid for the uniform 
what it looked like 
and explain how you felt about having to wear the uniform. 

Describe a time when something happened that changed your life in a good way. 
You should say: 
what happened 
when and where it happened 
how you felt about it 
and explain how this changed your life in a good way.

Describe a time when you felt tired after doing an activity. 
You should say: 
what activity you did 
when and where you did this activity 
why you did the activity 
and explain why you felt tired after doing this activity.

Describe something difficult you did and be proud of it in your work or studies. 
You should say: 
what you had done 
why you did this 
how difficult it was 
and explain why you felt so proud of yourself for doing it.

Describe an occasion when you had to do something very quickly. 
You should say: 
what you had to do 
why you had to do it quickly 
how difficult or easy it was to do 
and explain how you felt about having to do this thing very quickly.

Describe a time when you were very busy. 
You should say: 
when it was 
why you were so busy 
what you had to do 
and explain how you felt about being so busy.

Describe a time when you had to wait a long time for something nice to happen. 
You should say: 
what you were waiting for 
how long you waited 
why you had to wait 
and explain how you felt when the nice thing finally happened. 

Describe a time when you enjoyed visiting a park or a garden. 
You should say: 
where it was 
when you went there 
why you visited there 
what it looked like

Describe a time when a map was very useful to you.  
You should say: 
when this was 
where you got it 
how easy it was to use 
and explain why this map was very useful to you.

Describe a problem you had when using a computer. 
You should say: 
what it was 
when and where you had this problem 
how the problem was solved 
and explain how you felt when you had this problem

Describe a time when you gave a piece of advice to someone. 
You should say: 
who you gave advice to 
what it was 
how this person reacted to the advice 
and explain whether you feel you gave this person the right advice. 

Describe a time when other people near you were making a lot of noise. 
You should say: 
where you were 
who made the noise 
what the people were doing 
and explain how you felt about it.

Describe an occasion when you heard someone making a complaint in public.
You should say: 
who the person was 
what the person was unhappy about 
what was the result 
and explain how you felt about it.

Describe a time when you received bad service. 
You should say: 
where and when you received bad service 
who gave you this bad service 
what happened 
and explain how you felt when you received this bad service.

Describe a time when you helped someone to solve a problem. 
You should say: 
who you helped 
what problem he/she had 
how you helped him/her 
and explain how you felt about helping this person to solve the problem.

Describe a time when you found something that someone had lost. 
You should say: 
where and when you found it 
what you found 
what you did with this thing 
and explain how you felt about finding this thing.

Describe something you do regularly that helps you work or study. 
You should say: 
what you do 
when you do this 
how you feel when you do this 
and explain why doing this helps you work or study.

Describe a rule at work or school that you think is important. 
You should say: 
what it is 
how you knew this rule 
what happens if people break it 
and explain why you think this rule at work/school is important.

Describe a goal you have wanted to achieve for a long time. 
You should say: 
what your goal is 
how long you have wanted to achieve this goal 
what you need to do to achieve it 
and explain why you have wanted to achieve this goal for a long time. 

Describe an outdoor activity you enjoy doing.  
You should say: 
what it is 
when and where you do this activity 
who you do it with 
and explain why you enjoy doing it.

Describe something interesting that you would like to have. 
You should say: 
What it is 
How you know it 
Why you think it is interesting 
And explain why you would like to have it. 

Describe an area of science that you are interested in.
You should say: 
what it is 
when and where you first heard about it 
how you get more information about it now 
and explain why you are interested in this area of science. 

Describe a job that you do not like to do. 
You should say: 
what the job is 
how easy or difficult the job is 
how you know about this job 
and explain why you would not like to do this job. 

Describe a photo you have kept that makes you feel happy.
You should say: 
what it shows 
when and where the photo was taken 
how often you look at it 
and explain why this photo makes you feel happy.

Describe a painting or drawing you enjoy looking at.
You should say: 
when and where you first saw it 
what it was about 
what you know about the person who create it 
And explain why you enjoy looking at it.

Describe a place you would like to go to relax.
You should say: 
when you usually go to this place 
where you like to go to relax 
what you would do there 
and explain why you like to go to this place to relax.

Describe the part of your country that you find most interesting.
You should say: 
where it is 
how you know about it 
what people can see and do there 
and explain why you find it most interesting.

Describe a city which you think is beautiful.
You should say: 
where the city is 
how you know it 
what it is famous for 
and explain why you think this city is beautiful.

Describe a film you saw that you felt strongly about.
You should say: 
when and where you saw it 
what it was about 
why you decided to see it 
and explain why you felt strongly about it

Describe a period in history which you are interested in.
You should say: 
when it was 
what happened 
how you first heard about it 
and explain why you are interested in this period of history.

Describe a useful object in your home that you would find it difficult to live without.
You should say: 
what the object is for 
when you usually use it 
how long you have had it 
and explain why you would find it difficult to live without this object.

Describe a new public facility that has improved an area you know.
You should say: 
what it is 
where and when it was built 
what people can do there 
and explain how the new facility has improved the area.

Describe an advertisement you have seen that you think is good. 
You should say: 
what it is for 
what it shows 
when and where you saw it 
and explain why you think it is a piece of good advertisement.