Describe a person you know who enjoys dressing well.
Some instructions you can follow.
Who the person is
What job/studies the person does
What sort of clothes the person wears
And explain why you think this person enjoys dressing well.

Describe a time when you forgot an appointment (e.g. a doctor’s appointment or meeting a friend).
Some instructions you can follow.
When and where the appointment was
Why you forgot the appointment
What happened after you forgot the appointment
And explain how you felt about forgetting the appointment.

Describe a time when you saw a lot of plastic waste in a natural environment (e.g. a park, a beach, a river).
Some instructions you can follow.
When and where you saw this plastic waste
How you think this plastic waste got there
Why you noticed it
And explain how you felt about seeing plastic waste in this natural environment.

Describe a friend from childhood who you remember very well.
Some instructions you can follow.
Who the friend is
How you met him/her
What you used to do together
And explain why you remember this childhood friend so well.

Describe an object that you think is very beautiful.
Some instructions you can follow.
What the object is
Where you first saw the object
What it looks like
And explain how you feel about this beautiful object.

Describe someone from another culture (e.g. a friend, a teacher) who you enjoy spending time with.
Some instructions you can follow.
Who this person is
What his/her cultural background is
When and where you met this person
And explain why you enjoy spending time with this person from another culture.

Describe the home of somebody who you know well.
Some instructions you can follow.
Whose home this is
How often you go there
What this home looks like
And explain how you feel about this person's home.

Describe a film/movie you enjoyed and would like to see again.
Some instructions you can follow.
What the film/movie was
When and where you saw the film/movie
What the film/movie was about
And explain why you would like to see this film/movie again.

Describe a photo you took that you are proud of.
Some instructions you can follow.
Who or what was in your photo
When you took the photo
Why you took it
And explain why you are proud of this photo you took.

Describe a novel or a story you have read that you thought was particularly interesting.
Some instructions you can follow.
Why you read the novel story
What the novel/story was about
How long it took you to read it
And explain why you thought this novel/story was so interesting.

Describe a time when you disagreed with somebody about something.
Some instructions you can follow.
Who you disagreed with
What you disagreed about
What the result of this disagreement was
And explain how you felt about disagreeing with this person.

Describe a time when you had to find some information.
Some instructions you can follow.
What kind of information you had to find
Where you looked for the information
How much you enjoyed looking for the information
And explain why you needed the information.

Describe an English lesson that you really enjoyed.
Some instructions you can follow.
Where the lesson took place
What the lesson was about
What the teacher did
And explain why you enjoyed this lesson so much.

Describe a time when you succeeded in doing something that was difficult.
Some instructions you can follow.
What you succeeded in doing
Why it was difficult to do
How much help you needed
And explain how you felt when you succeeded in doing this difficult thing.

Describe a time when someone gave you some money as a gift.
Some instructions you can follow.
Who gave you the money
Why they gave it to you
What you did with it
And explain how you felt about receiving this money.

Describe a time when you had to share something with another person or other people
Some instructions you can follow.
What you had to share
Who you had to share with
Why you had to share
And explain how you felt about sharing something with another person other people.

Describe a programme that you enjoyed very much (e.g. on TV or the internet).
Some instructions you can follow.
What the programme was about
Where you watched this programme
Who you watched it with
And explain why you enjoyed this programme so much.

Describe a part of your country that you would recommend to visitors.
Some instructions you can follow.
Which part of your country you would recommend
How you know about this part of your country
Whether many visitors go there
And explain why you would recommend this part of your country to visitors.

Describe something important that you learned, not in school or college.
Some instructions you can follow.
What you learned
How you learned it
How easy/difficult it was to learn
And explain why learning this was important to you.

Describe a person you know who enjoys growing plants (e.g. flowers, vegetables, fruit trees).
Some instructions you can follow.
How you know this person
What plants this person enjoys growing
Where this person grows plants
And explain why you think this person enjoys growing these plants.

Describe a popular place for playing sport (e.g. a stadium, a sports centre) that you know about.
Some instructions you can follow.
Where this place for playing sport is
How you know about this place
Whether you have visited this place
And explain why you think this place for playing sport is popular.

Describe a person who inspired you to do something interesting.
Some instructions you can follow.
Who the person is
What interesting thing you did
How this person inspired you to do this thing
And explain how you felt after this person inspired you to do something interesting.

Describe a time when you made a decision to wait for something.
Some instructions you can follow.
What you decided to wait for
What you did while you were waiting
How you felt while you were waiting
And explain why deciding to wait was a good/bad decision.

Describe a place you went to do an outdoor activity.
Some instructions you can follow.
Where you went and when
What outdoor activity you did at this place
Why you did this outdoor activity
And explain how you felt about doing the outdoor activity at this place.

Describe a problem you had when you bought something in a shop/store or online.
Some instructions you can follow.
What you bought
Where and when you bought it
What problem you had with it
And explain how you felt about having this problem.

Describe an interesting decision that you and your friend made together
You should say:
When and why you made the decision
What the decision was about
Why you made the decision together
And explain why you think it was interesting

Describe an article on health you read in a magazine or on the internet
You should say:
What it was
Where you read it
Why you read it
And how you felt about it

Describe a noisy place you have been to
You should say:
Where it is
When you went there
What you did there
And explain why you feel it's a noisy place

Describe a skill that you think you can teach other people
You should say:
What it is
When you learned it
How you can teach others
And how you feel about this skill

Describe an intelligent person you know
You should say:
Who this person is
How you knew this person
What this person does
And explain why you think this person is intelligent

Describe a person you disliked at first but ended up being friends with
You should say:
Who he/she is
How you knew him/her
Why you disliked him/her at first but changed your mind
And explain how you feel about the experience

Describe a person who persuaded you to do something
You should say:
When it happened
What he/she persuaded you to do
Why he/she persuaded you to do it
And explain whether you did it at last

Describe a photo you took that you are proud of
You should say:
When you took it
Where you took it
What is in this photo
And explain why you are proud of it

Describe a time when you made a plan to do an activity with a lot of people
You should say:
What it was
When and where you made it
What the activity was
And explain how you felt about the plan

Describe a time when you saw children behave badly in public
You should say
Where it was
What the children were doing
How others reacted to it
And explain how you felt about it

Describe a beautiful sky you enjoyed seeing
You should say:
Where you saw it
Who you saw it with
What you saw
And how you felt about it

Describe an advertisement which introduced a product you have seen
You should say:
When and where you saw the advertisement
What the product was
How you liked the advertisement
And explain how you felt about it


