{
    "real_questions": [
        {
            "topicName": "Work",
            "topicId": "B0_topic1",
            "questions": [
                "How do you usually spend your day at work?",
                "Do you find it easy to organize your time at work?",
                "Who helps you most in your work?",
                "What do you do?",
                "Have you always wanted to do this kind of work?",
                "Do you work best in the morning or the afternoon?"
            ]
        },
        {
            "topicName": "Study",
            "topicId": "B0_topic2",
            "questions": [
                "How do you usually spend your day when you’re studying?",
                "Do you find it easy to organize your study time?",
                "Who helps you most in your studies?",
                "What do you study?",
                "Have you always wanted to study this subject/these subjects?",
                "Do you study best in the morning or the afternoon?"
            ]
        },
        {
            "topicName": "Hometown",
            "topicId": "B0_topic3",
            "questions": [
                "Tell me about your hometown / where is your hometown?",
                "Did you learn about the history of your home town when you were at school?",
                "What is your home town famous for today?"
            ]
        },
        {
            "topicName": "Where you live",
            "topicId": "B0_topic4",
            "questions": [
                "Do you live in a house or an apartment?",
                "What is your favourite room in your home?",
                "What things make your home pleasant to live in?"
            ]
        },
        {
            "topicName": "Boring",
            "topicId": "B0_topic5",
            "questions": [
                "Do you usually feel bored?",
                "Did you ever find school boring when you were a child?",
                "What sort of things do you find boring?",
                "What do you do to stop yourself feeling bored?"
            ]
        },
        {
            "topicName": "Different things you keep",
            "topicId": "B0_topic6",
            "questions": [
                "Have you kept many things from your childhood?",
                "Do you like to keep things for a long time?",
                "Where do you usually keep things that you need every day, like money or keys?",
                "Do you like to keep all the photos you take?"
            ]
        },
        {
            "topicName": "Old buildings",
            "topicId": "B0_topic7",
            "questions": [
                "Have you ever visited any important old buildings?",
                "Do you like to live in an old building or a modern building?",
                "Is there an old building you’d like to visit in the future?",
                "Is it important to look after old buildings?"
            ]
        },
        {
            "topicName": "Sitting down",
            "topicId": "B0_topic8",
            "questions": [
                "Do you usually have to sit for a long time?",
                "Did you like sitting on the floor when you were a child?",
                "Can you easily fall asleep when you are sitting in a chair?",
                "Do you have favourite place where you like to sit?"
            ]
        },
        {
            "topicName": "Personal talents",
            "topicId": "B0_topic9",
            "questions": [
                "Is there a talent you already have that you’d like to improve?",
                "What kinds of things do you think you’re good at?",
                "Do you have the same talents as anyone else in your family?",
                "Do you think you will use your talents in a future job?"
            ]
        },
        {
            "topicName": "Meeting friends",
            "topicId": "B0_topic10",
            "questions": [
                "Where do you like to go to meet your friends?",
                "Why are some places better than others for meeting friends?",
                "Do you prefer to meet just one friend or a group of friends together?",
                "Have the types of places where you meet friends changed since you were younger?"
            ]
        },
        {
            "topicName": "Computer or a tablet",
            "topicId": "B0_topic11",
            "questions": [
                "Can you remember when you first started using a computer or tablet?",
                "What do you most often use a computer or a tablet for?",
                "Do you find computers or tablets difficult to use?",
                "How would your life be different if there were no computers?"
            ]
        },
        {
            "topicName": "Watches",
            "topicId": "B0_topic12",
            "questions": [
                "Did you wear a watch when you were young?",
                "Have you ever received a watch as a gift?",
                "Do you usually wear a watch now?",
                "Why do you think some people like to wear expensive watches?"
            ]
        },
        {
            "topicName": "What you do in the evening",
            "topicId": "B0_topic13",
            "questions": [
                "What do you often do in the evening?",
                "How did you typically spend your evenings when you were a child?",
                "Do you spend your evenings the same way during the week as you do on weekends?",
                "Is there anything you don’t like to do in the evenings?"
            ]
        },
        {
            "topicName": "Advertisements",
            "topicId": "B0_topic14",
            "questions": [
                "Do you often remember advertisements that you’ve seen?",
                "Have you ever seen an advertisement that you really didn’t like?",
                "Would you like to be in an advertisement or a commercial one day?",
                "What do you usually do when an advertisement or a commercial comes on TV or the internet?"
            ]
        },
        {
            "topicName": "Science",
            "topicId": "B0_topic15",
            "questions": [
                "Do you watch science programmes on TV?", 
                "Did you enjoy science lessons at school? ",
                "Would you like to know more about science? ",
                "Are science museums popular in China? "
            ]
        },
        {
            "topicName": "Books and reading",
            "topicId": "B0_topic16",  
            "questions": [
                "Do you read more or less now than when you were a child? ",
                "Have you ever watched a film and then read the book? ",
                "When do you have most time to read? ",
                "How often do you buy books? "
            ]
        },
        {
            "topicName": "Sport",
            "topicId": "B0_topic17",
            "questions": [
                "Did you learn to play any sports as a child? ",
                "Are there any sports you would like to try in the future? ",
                "Do you believe all children should participate in sports at school? ",
                "What sports do you like to watch or play? "
            ]
        },
        {
            "topicName": "Mirrors",
            "topicId": "B0_topic18",
            "questions": [
                "How often do you use a mirror? ",
                "Would you buy clothes without checking yourself in a mirror? ",
                "Have you ever bought a mirror? ",
                "Do you think mirrors are a good way to decorate a room? "  
            ]
        },
        {
            "topicName": "Taking photos",
            "topicId": "B0_topic19",
            "questions": [
                "How often do you take photos? ",
                "Do you like taking selfies? ",
                "Do you have a favorite family photo? ",
                "Would you like to improve your skill of taking photos? "
            ]
        },
        {
            "topicName": "Cars",
            "topicId": "B0_topic20",
            "questions": [
                "Do you think the colour of a car is important to you? ",
                "What kinds of car would you most like to have in the future? ",
                "Did you enjoy travelling by car when you were young? ",
                "Would you prefer to be a driver or a passenger in a car? " 
            ]
        },
        {
            "topicName": "Websites",
            "topicId": "B0_topic21",
            "questions": [  
                "What kinds of websites do you use most often? ",
                "Do you prefer to get information from websites or books? ",
                "Which is more important to you, what a website looks like or how easy it is to use? ",
                "Does your favorite website look the same now as when you first used it? "
            ]
        },
        {
            "topicName": "Street markets",
            "topicId": "B0_topic22",
            "questions": [
                "What are the best things to buy at street markets? ",
                "Do you like going to street markets on holidays? ",
                "When was the last time you went to a street market? ",
                "Which do you prefer: shopping at street market or shopping at a shopping centre? "
            ]
        },
        {
            "topicName": "Watching sport",
            "topicId": "B0_topic23",
            "questions": [
                "Do you like to watch sport on TV? ",
                "Have you ever been to watch a live sports event? ",
                "Do you like to watch sport alone or with other people? ",
                "Is there a sports event you might like to watch in the future? "
            ]
        },
        {
            "topicName": "Art",
            "topicId": "B0_topic24",
            "questions": [
                "Do you like looking at drawing or painting? ",
                "Did you learn to draw or paint when you were a child? ",
                "Have you ever visited an art gallery? ",
                "Would you like to learn more about art in the future? "
            ]
        },
        {
            "topicName": "Finding and losing things",
            "topicId": "B0_topic25",
            "questions": [
                "What type of lost things have you found in a public place? ",
                "What would you do if you found something valuable? ",
                "Would you ever ask for help on social media to find something you’d lost? ",
                "Have you ever lost something which was found by a stranger? "
            ]
        },
        {
            "topicName": "Email",
            "topicId": "B0_topic26",
            "questions": [
                "Is email popular in your country? ",
                "Do you send a lot of emails? ",
                "Do you prefer to email people or speak to them on the phone? ",
                "Do you think people will use email more or less in the future? "
            ]
        },
        {
            "topicName": "Daily life routine",
            "topicId": "B0_topic27",
            "questions": [
                "Do you prefer to go to bed early or late? ",
                "What do you often do in the morning? ",
                "Do you like to do the same things every weekend? ",
                "Will you change your daily routine in the future? "
            ]
        },
        {
            "topicName": "Dreams",
            "topicId": "B0_topic28",
            "questions": [
                "How often do you remember your dreams after you wake up? ",
                "Do you like hearing about other people’s dreams? ",
                "Do you think dreams can have special meanings? ",  
                "Would you like to learn more about the subject of dreams? "
            ]
        },
        {
            "topicName": "Cell phones",
            "topicId": "B0_topic29",  
            "questions": [  
                "Do you send many text messages? ",
                "Do you like using a cell phone? ",
                "When did you first have a cell phone? ",
                "Are there any places where you would not use a cell phone? "
            ]
        },  
        {
            "topicName": "Cinema",
            "topicId": "B0_topic30",
            "questions": [
                "Did you go to the cinema a lot when you were a child? ",
                "Do you prefer to go to the cinema with friends or alone? ",
                "Which is more popular in your country: watching movies at movie theatre, or watching movies at home? ",
                "Do you still like the same movies that you liked when you were young? "
            ]
        }   
    ]
}