Describe a person you know who likes to talk a lot. 
话痨（新题） 
1. How should parents encourage their children? 
2. Why do some children talk more than other children? 
3. Under what circumstances do children need to learn not to speak? 
4. What kinds of jobs involve talking to groups of people? 
5. What skills do people need to give a good speech? 
6. What are the benefits of being a good communicator in today's society? 

Describe a person you know who works well in a team 
给力的队友（新题） 
1. What qualities should a leader have? 
2. What will happen if a team doesn’t have a good leader? 
3. Why do some people dislike teamwork? 
4. Do you think young people are good team players? 
5. What are the advantages of being in a team? 
6. Do children learn better if they work in a team at school? 

Describe a person who you think is good at making visitors to his or her home feel welcome. 
善于待人接物的人（新题） 
1. Do people in your country often invite others to their homes? 
2. What kind of people are more likely to invite others to their homes? 
3. Why do people offer food when visitors come to their home? 
4. Is it important to make visitors feel welcome in your country? 
5. Are tourist attractions in the countryside more welcome than those in the cities? 
6. How can cities be more welcoming to tourists? 

Describe an interesting conversation you had with a very old person. 
与老人的有趣谈话（新题） 
1. What can younger people learn from older people? 
2. What are the advantages of living with people of different ages? 
3. When can older people do better than younger people? 
4. What is the best age for people to stop working and retire? 
5. Do you think old age should stop people from being active and adventurous or not? 
6. What is the attitude towards the elderly in today's society? 

Describe an interesting person who you have never met, but would like to know more about. 
想了解的有趣陌生人
1. How can people get to know new people? 
2. Can clothing tell and reveal a person's personality? 
3. Do people feel lonely in crowded cities? 
4. Why do some people find it easier to be friends with people than others? 
5. Why do individuals from the same family have different personalities? 
6. Is someone's personality fully developed in childhood? 

Describe a person who always has interesting ideas and opinions. 
想法有趣的人
1. When do children start to have their own opinions? 
2. Are children's opinions influenced by their parents? 
3. How can teachers help children to develop their own ideas? 
4. How do inventors or philosophers come up with new ideas?  
5. Who have lots of widely respected ideas in your country? 
6. Why are some people unwilling to change their way of thinking? 

Describe someone you studied with who is successful in his/her life. 
成功的同学
1. What do students need to do to succeed in school? 
2. Is it easy for students to succeed in school these days? 
3. Why do some people think money is the best way to measure success? 
4. Is success in school the most important thing for young people? 
5. What sacrifices may people need to make in order to achieve success? 
6. Is it harder for people to succeed today than in the past? 

Describe a person you know about who runs a successful business. 
成功的经营者
1. What types of family businesses often run in your country? 
2. What are the advantages and disadvantages of working in a family business? 
3. What factors lead to success? 
4. What do people need to sacrifice for success? 
5. Is it easy for people to succeed in the national testing your country? 
6. Is it easy for a business to be successful without affecting the environment? 

Describe a person who enjoys cooking for others. 
喜欢烹饪的人
1. What do we need to prepare when we need to cook? 
2. Should students learn to cook at school? 
3. Are there any differences between cooking today and in the past? 
4. Is food the most important part of Chinese festivals and ceremonies? 
5. Which dishes are a must at festivals? 
6. Should cooking be a required or optional course? Why? 

Describe a person from another culture who speaks Chinese very well. 
中文很好的外国人
1. What foreign languages do Chinese children learn? 
2. Why do Chinese children learn English? 
3. Why are so many people learning English? 
4. Do you think the way people learn English today is the same as in the past? 
5. Is it easier for children to learn languages than adults? 
6. How can teachers make language learning more fun for children? 

Describe a successful sportsperson that you admire
钦佩的运动员
1. What are the most popular sports in your country? 
2. What qualities make a top athlete? 
3. Which is more important, winning in a team sport or winning as individual? 
4. Should students have physical education and do sports at school? 
5. Is it important to identify children's talents? 
6. Should adults force children to become sports champions? 

Describe a time when you did an exciting activity with other people 
刺激的活动
1. What kinds of exciting activities that young people like to do in your country? 
2. Why do people choose to do exciting activities, such as extreme sports? 
3. How do people benefit from trying new things? 
4. Why are some people reluctant to try new things? 
5. Are people less willing to try new things as they get older? 
6. Should people engage in dangerous stimulating activities? 

Describe a time when you went to a party that you enjoyed. 
聚会
1. Why do people in your country host parties? 
2. Why do some people not like going to parties? 
3. What would you do if you were disturbed by neighbor’s party? 
4. What are the differences between holding a party at home and in a public place? 
5. Do you think music and dancing are a must at a party? 
6. How do people's attitudes vary when it comes to parties? 

Describe an important journey you made where there was a delay. 
重要旅程的推迟（新题） 
1. What are the main means of transport in your country? 
2. What can the government do to improve transport in your country? 
3. Is travelling better in the past than it is now? 
4. Do you think that tourist attractions help people learn about new cultures? 
5. What difficulties do people often face when travelling?
6. What are the environmental problems caused by the modern way of travel？

Describe an unusual holiday you went on. 
不寻常的假期（新题） 
1. Do people in your country have long enough holidays? 
2. Which holidays are popular in your country? 
3. Are there any popular places for holidays in your country? 
4. How important is tourism to your country? 
5. What are the differences between old and young people when spending their holidays? 
6. Is it a good way to know more about another culture through going abroad? 

Describe an activity that you really enjoyed doing at primary school. 小学喜欢的活动（新题）
小学喜欢的活动（新题） 
1. What activities do children like to do in your country? 
2. What do parents in your country encourage their children to do? 
3. What are the differences between activities at home and at school? 
4. Do you think technology has changed the kinds of activities that children enjoy? 
5. Why do people enjoy spending time with others? 
6. How can happiness affect people’s health? 

Describe a time when you went to a street market.
街市购物（新题） 
1. What kinds of markets are there in China? 
2. Will small markets disappear in the future? 
3. Have people's shopping habits changed in recent years? 
4. What are the differences between shopping in street markets and big shopping malls? 
5. Are the goods sold at discount stores good values or qualities? 
6. Why do some people like to buy expensive goods? 

Describe a skill you enjoyed learning as a teenager. 
少时学习的技能（新题） 
1. Where do children learn skills in your country? 
2. What are the differences between learning skills on your own and from others? 
3. What should children learn to do at an early age? 
4. Can children and old people learn from each other? 
5. What's the best way to learn practical skills?
6. What are the differences between children learning skills and adults learning skills? 

Describe a time when you had to wear a uniform. 穿制服的时刻（新题）
穿制服的时刻（新题） 
1. Why should students wear uniforms at school? 
2. Why should people in some jobs have to wear uniforms? 
3. What are the advantages and disadvantages of wearing a school uniform? 
4. What are disadvantages of wearing a uniform at work? 
5. Do you think clothes can reflect people’s character? 
6. Why many young people wear the same clothes as their peers? 

Describe a time when something happened that changed your life in a good way. 改变人生的时期
改变人生的时期
1. Do children enjoy the variety in their daily lives? 
2. What difficulties may children face when changing schools? 
3. Why do some people quit and change jobs? 
4. At what age do children really become adults? 
5. How do people adapt to changes in life? 
6. In general, does change help people develop in new ways? 

Describe a time when you felt tired after doing an activity. 
感到累的活动
1. What are things that often make people tired? 
2. Do people today feel more tired than people in the past? 
3. What are the differences between feeling tired after studying and after exercising? 
4. How do people balance their work responsibilities with the need for free time? 
5. Do people have enough free time now? 
6. Do people have fewer holidays now than in the past? 

Describe something difficult you did and be proud of it in your work or studies.
困难任务
1. What are the things that make people feel proud of? 
2. Do people often feel proud of themselves when they complete a difficult task? 
3. What personal qualities help a person deal with difficulties at work? 
4. What will be the impact of more people freelancing in the future? 
5. Is work the biggest source of stress for most people? 
6. Would a future in which people do not have to work be an ideal goal for society? 

Describe an occasion when you had to do something very quickly. 
快速完成某事（新题） 
1. On what occasions do people have to do things in a hurry? 
2. Why do people sometimes need to make decisions quickly? 
3. What are the advantages of making decisions quickly? 
4. Why do some people spend a long time on having a meal? 
5. Would people feel more satisfied if they finished doing something quickly? 
6. Why do some people choose to make a long journey by bus or train than by plane? 

Describe a time when you were very busy. 
忙碌的时刻（新题） 
1. On what occasions do people have to do things in a hurry? 
2. Why do some people spend a long time on having a meal? 
3. Would people feel more satisfied if they finished doing something quickly? 
4. What are the things that make people lives busy now? 
5. Why do some people feel their lives are busier now than in the past? 
6. What can people do to organize their time well? 

Describe a time when you had to wait a long time for something nice to happen. 
等待美好事情
1. On what everyday occasions do people have to wait for a long time? 
2. What do people usually do while waiting? 
3. Are most people happy to wait for things in everyday life? 
4. Why do most children have difficulties waiting for a long time? 
5. Do people appreciate things more when they have to wait? 
6. Do people queue consciously while waiting for the subway train? 

Describe a time when you enjoyed visiting a park or a garden. 
逛公园
1. Do young people like to go to parks? 
2. What do old people like to do in parks? 
3. What are the benefits of going to the park for young people and old people? 
4. Why do some people like planting flowers? 
5. What benefits can parks bring to a city? 
6. Should people who live in cities help to keep parks tidy? 

Describe a time when a map was very useful to you.
有用的地图（新题） 
1. What do people usually do when they get lost? 
2. What are the differences between paper and digital maps? 
3. Should everyone learn to read a map? 
4. Do most people prefer to use paper maps, or do they use maps on their phones? 
5. Is a car navigation system always a good thing? 
6. Why are some places or cities easier for people to get lost than other places or cities? 

Describe a problem you had when using a computer.
电脑出问题
1. How do people learn how to use a new device? 
2. Are the latest smartphones usually no better than previous models? 
3. Why do people often have trouble learning how to use new devices? 
4. Should parents limit their children's screen time? 
5. Why do many young people spend so much time looking at screens? 
6. Does relying on technology prevent children from learning skills? 

Describe a time when you gave a piece of advice to someone. 
给他人建议
1. What kinds of advice do parents often give their young children? 
2. Should parents give their children advice? 
3. Is it necessary for people to listen to friends’ advice? 
4. How do people give young people and old people advice? 
5. Are teachers the best people to give students advice about jobs? 
6. Why do some people refuse to accept good advice? 

Describe a time when other people near you were making a lot of noise.
嘈杂的时刻（新题） 
1. What kinds of public places should have no noise? 
2. Should small children be allowed into places where people need to be quiet? 
3. Is it important for people to behave well in public places? 
4. Why do some people behave better than others in public places? 
5. Why do crowds often get very noisy in public places? 
6. What public morals should people follow in your country? 

Describe an occasion when you heard someone making a complaint in public
听见别人投诉（新题） 
1. How do companies train their staff to deal with complaints? 
2. What do people usually complain about? 
3. How do most people complain, in writing or by other methods? 
4. Why do some people complain more than others? 
5. Should company offer compensation to dissatisfied customers? 
6. Is complaining a positive experience for the person who complains? 

Describe a time when you received bad service.
糟糕服务
1. What kinds of bad service do people often receive? 
2. What should people do if they get bad service? 
3. Why don't some people complain about bad service? 
4. What can employers do to ensure the quality of service? 
5. Does providing good employee training always lead to good customer service? 
6. Why are some people often dissatisfied with customer service? 

Describe a time when you helped someone to solve a problem. 
帮助他人
1. Should children be taught to be kind to others? 
2. What kinds of housework can children help their parents do? 
3. Should parents avoid helping their children with homework? 
4. Is it easier to help a friend than a stranger? 
5. Do parents need to teach their children to be kind and helpful to others? 
6. Is it possible for people to be too kind? 

Describe a time when you found something that someone had lost. 
捡到失物（新题） 
1. What kinds of things do people often find? 
2. What kind of things do people often lose? 
3. What kind of people tend to lose things more often than others? 
4. Why do some people find lost things easier than others? 
5. What should parents teach children to do when they find things? 
6. Why do some people pick lost things and don't give back? 

Describe something you do regularly that helps you work or study.
有助学习工作的习惯（新题） 
1. What do people do every day as part of their personal routine? 
2. Do children need to have a daily routine? 
3. Why are routines essential in people’s jobs? 
4. How do people organize their routines after getting up in the morning and after work? 
5. Is it necessary at work to take regular breaks in people’s daily life? 
6. Are routine important for companies? 

Describe a rule at work or school that you think is important. 
重要规定
1. What rules should children follow at home in your country? 
2. On what occasions can children be forgiven if they don’t follow some rules? 
3. What rules should people follow when using public transport? 
4. Is it normal for children to want to break the rules at home? 
5. Should children join in deciding what the rules are at home? 
6. Are there too many notices with rules displayed in public places? 

Describe a goal you have wanted to achieve for a long time. 
长久的目标（新题） 
1. What goals do young people usually have? 
2. What can people do to prepare for their life in the future? 
3. How can school help you people to achieve their goals? 
4. Is it necessary to give advice to children? 
5. What should people do to achieve their goals? 
6. How easy is it to achieve a balance between preparing for the future and enjoying life? 

Describe an outdoor activity you enjoy doing.
喜欢的室外活动（新题） 
1. Do people go outdoors more or less now? 
2. What can people do outdoors besides exercising? 
3. When do people usually go outdoors to get close to nature? 
4. What can people do to get close to nature? 
5. Will people spend more time doing outdoor activities in the future? 
6. How important is it for people to spend time in nature? 

Describe something interesting that you would like to have
感兴趣的东西（新题） 
1. What do you think young people spend most of their money on? 
2. Do you think it is important to save money? Why? 
3. Do people buy things they don't need? 
4. Is it important to teach children about giving money to support people in need 
5. Should rich people give some of their money to help other people 
6. What can people do to support others in mind, apart from giving money to them 

Describe an area of science that you are interested in
感兴趣的科学领域
1. Is it important to study Science at school? 
2. Which science subject is the most important for children to learn? 
3. Should people continue to study Science after graduating from school? 
4. Should scientists explain the research process to the public? 
5. Why do some children not like learning science at school? 
6. What are the skills or qualities that a good scientist needs to have? 

Describe a job that you do not like to do
不想做的工作（新题） 
1. What kind of jobs do Chinese young people like to do? 
2. Do young Chinese people prefer to choose an interesting job or a job with a high salary? 
3. Do you think it is easier to get a job now than in the past? 
4. Is it important to be successful in a job? 
5. How can robots and technology change people's jobs? 
6. How usual is it for young people to move to another city to find a job? 

Describe a photo you have kept that makes you feel happy.
喜欢的照片
1. What kinds of things do people like to take photos of? 
2. Do people take more photos now than in the past? 
3. Is equipment important for photography? 
4. Are professional photographers more important now than in the past? 
5. Why do people often share their photos on social media? 
6. Is it easier to trust a visual image or the written word? 

Describe a painting or drawing you enjoy looking at. 
一幅画
1. What kinds of painting and drawing do children often enjoy? 
2. Should children learn to draw and paint at school? 
3. What can young people learn from looking at works of art? 
4. How does architectural style affect people's lives? 
5. Is it important for people to choose the art and decorations in their home? 
6. Do you think the objects we use in our daily lives should be beautifully designed? 

Describe a place you would like to go to relax
放松的地方（新题） 
1. Are there enough places for people to relax in your country? 
2. What do people usually do after school or work? 
3. Is physical activity the best way to relax? 
4. Do you think that spending time in front of a screen helps people relax? 
5. Can people get enough relaxation without a lot of money? 
6. Why are some places better than other places for relaxing? 

Describe the part of your country that you find most interesting. 
感兴趣的地方
1. How can people access travel information? 
2. What makes a place interesting for people to live in? 
3. Is a great tourist destination also a good place to live? 
4. Do youngsters like to try new things, or do people of your parents' age also like to try new things? 
5. Do people have different personalities in different regions of your country? 
6. What causes the differences between different regions of your country? 

Describe a city which you think is beautiful. 
美丽的城市
1. Why do some people like to visit historical sites? 
2. Why can it be difficult to look after historic towns and cities? 
3. Should governments protect historic towns and cities? 
4. How can governments preserve historical buildings? 
5. How may towns and cities change in the future? 
6. What are the reasons why so many modern towns and cities have tall buildings? 

Describe a film you saw that you felt strongly about. 
印象深刻的电影（新题）
1. Do most people prefer to watch movies at home or in a cinema? Why? 
2. What are the advantages of going to the cinema with friends? 
3. Is going to the cinema still popular? 
4. What kind of movies need to be seen in the cinema to be fully appreciated? 
5. What can cinemas do to attract more audiences? 
6. Can people learn new cultures through movies? 

Describe a period in history which you are interested in. 
感兴趣的历史时期
1. Are there any interesting historical places worth visiting in your country? 
2. What are the reasons why people are interested in watching historical films? 
3. Do children spend too much time studying history? 
4. What is the value of museums as a way to study history? 
5. Why is it important for people to remember personal events from the past? 
6. Why do some people think it's wrong to let the past influence their decisions? 

Describe a useful object in your home that you would find it difficult to live without. 
离不开的物品（新题）
1. What are the benefits of using technology in the workplace? 
2. What home equipment do people use most often? 
3. Do people have too much equipment in their homes? 
4. Why do some people in the workplace dislike technology? 
5. Is cheap equipment likely to work better than expensive equipment? 
6. Why do people buy a lot of household appliances? 

Describe a new public facility that has improved an area you know. 
有益的公共设施（新题）
1. What kinds of public facilities do people often use now? 
2. What are the benefits of public facilities? 
3. Are new public facilities always better than old ones? 
4. Why are some public facilities not used much by people? 
5. What kind of transport do young people and old people prefer?
6. What do you think are the differences between Chinese square dancing now and in the future? 

Describe an advertisement you have seen that you think is good. 
有益的广告
1. What kinds of things people like to buy? 
2. Why do some people enjoy buying new things? 
3. Why do many people dislike online ads? 
4. Should people only buy what they really need? 
5. Should online advertising aimed at children be banned? 
6. How much exaggeration is necessary for an advertisement to be successful? 